[
  {
    "title": "Javascript Developer, Skyvera (Remote) - $40,000/year USD",
    "company": "Crossover",
    "location": "Egypt",
    "description": "Crossover is the world's #1 source of full-time remote jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Skyvera. Have you got what it takes?<br><br>Skyvera is searching for a PHP expert who thrives in fast-paced environments and is eager to drive technological advancements in the telecommunications industry. This role is ideal for someone who excels in PHP development and is passionate about leading teams towards innovation.<br><br>The telco industry often suffers from the slow pace of adopting new technologies and methodologies. At Skyvera, we distinguish ourselves by rapidly embracing and implementing the latest cloud and PHP technologies. As our subject matter expert, you will be a catalyst in accelerating this shift, moving away from conventional development processes to more agile, efficient practices.<br><br>Your role will involve leading the development and delivery of cutting-edge PHP solutions both in front-end and back-end services. Your expertise in PHP development will not only contribute to the creation of advanced software solutions, but also drive the strategic direction of our product offerings. You'll play a pivotal role in ensuring our solutions align with client needs and industry trends.<br><br>Joining Skyvera means becoming part of a dynamic, forward-thinking company where innovative ideas are valued and professional growth is encouraged. If you're ready to join us in transforming the telco domain, apply now!<br><br><strong>What You Will Be Doing<br><br></strong><ul><li>Spearheading the development of customer-facing UIs and back-end services using PHP, ensuring scalable and efficient solutions</li><li>Taking ownership of end-to-end project delivery, working closely with cross-functional Agile teams</li><li>Guiding and mentoring a talented engineering team, promoting the use of best practices and fostering a culture of technical excellence<br><br></li></ul><strong>What You Won’t Be Doing<br><br></strong><ul><li>Being confined to outdated technologies - we prioritize modern, cloud-based solutions</li><li>Working in silos - you’ll be part of a dynamic team that thrives on collaborative efforts<br><br></li></ul><strong>Basic Requirements<br><br></strong><strong>Javascript Developer key responsibilities<br><br></strong><ul><li>At least 4 years of professional experience in PHP development</li><li>Familiarity with front-end technologies (HTML5, JavaScript, CSS3) and MySQL</li><li>The ability to integrate applications with third-party services using REST APIs with formats like JSON and XML<br><br></li></ul><strong>About Skyvera<br><br></strong>Skyvera maintains your legacy, on-premise software, while reimagining its cloud-native future.<br><br>There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!<br><br><strong>Working with Crossover<br><br></strong>This is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover. The compensation level for this role is $20 USD/hour, which equates to $40,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.<br><br><strong>What to expect next:<br><br></strong><ul><li>You will receive an email with a link to start your self-paced, online job application.</li><li>Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.<br><br></li></ul><strong>Important!</strong> If you do not receive an email from us:<br><br><ul><li>First, emails may take up to 15 minutes to send, refresh and check again.</li><li>Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.</li><li>Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.</li><li>If all else fails, just reset your password by visiting https://www.crossover.com/auth/password-recovery if you already applied using LinkedIn EasyApply.<br><br></li></ul>Crossover Job Code: LJ-5169-EG-Cairo-JavascriptDeve<br><br>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/javascript-developer-skyvera-remote-%2440-000-year-usd-at-crossover-3764110595",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Java Software Engineer, Skyvera (Remote) - $20,000/year USD",
    "company": "Crossover",
    "location": "Egypt",
    "description": "Crossover is the world's #1 source of full-time remote jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Skyvera. Have you got what it takes?<br><br>If you are excited by complex coding challenges, this is your chance to shine. Skyvera is paving the way for telcos to embrace the public cloud, and we need a skilled developer whose technical expertise and innovative mindset can fuel this transformation.<br><br>In this role, you will provide development support for our OSS/BSS projects. You'll navigate through the lifecycle of our applications—tending to maintenance, updates, and critical operational issues with speed and precision. You'll leverage your mastery of Java and its frameworks to craft solutions that are robust and reliable, ensuring that our suite of products operates seamlessly in production environments.<br><br>Your responsibilities will stretch beyond code development as you contribute to the strategic direction of our solutions, pinpointing opportunities for improvement and driving the evolution of our products. It's all about making an impact that resonates throughout the industry, ensuring Skyvera remains at the forefront of the public cloud revolution.<br><br>If you're eager to leave your mark on an industry at the cusp of transformation, we're ready to welcome you. Apply now and join a team that’s crafting the very future of telecommunications!<br><br><strong>What You Will Be Doing<br><br></strong><ul><li>Providing dev support for OSS/BSS projects, ensuring high-quality maintenance and seamless updates of our existing product suite</li><li>Developing software solutions by studying information needs, conferring with users, and observing system flows</li><li>Documenting solutions with flowcharts, layouts, diagrams, charts, and code comments<br><br></li></ul><strong>What You Won’t Be Doing<br><br></strong><ul><li>Getting stuck with outdated technologies, without the opportunity to work with leading-edge tools</li><li>Handling monotonous tasks that don’t challenge you or contribute to your professional growth<br><br></li></ul><strong>Java Software Engineer Key Responsibilities<br><br></strong><ul><li>Upholding the reliability and performance of our product suite, ensuring that our solutions align perfectly with the functional and operational needs of our customers<br><br></li></ul><strong>Basic Requirements<br><br></strong><ul><li>At least 2 years of professional experience as a Java developer (excluding university courses)</li><li>Knowledge of Object-Oriented Programming (OOP) patterns and concepts</li><li>Familiarity with J2EE frameworks, ZK framework, AngularJS, and SOAP/REST</li><li>Basic SQL skills<br><br></li></ul><strong>About Skyvera<br><br></strong>Skyvera maintains your legacy, on-premise software, while reimagining its cloud-native future.<br><br>There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!<br><br><strong>Working with Crossover<br><br></strong>This is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover. The compensation level for this role is $10 USD/hour, which equates to $20,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.<br><br><strong>What to expect next:<br><br></strong><ul><li>You will receive an email with a link to start your self-paced, online job application.</li><li>Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.<br><br></li></ul><strong>Important!</strong> If you do not receive an email from us:<br><br><ul><li>First, emails may take up to 15 minutes to send, refresh and check again.</li><li>Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.</li><li>Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.</li><li>If all else fails, just reset your password by visiting https://www.crossover.com/auth/password-recovery if you already applied using LinkedIn EasyApply.<br><br></li></ul>Crossover Job Code: LJ-5165-EG-Cairo-JavaSoftwareEn<br><br>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/java-software-engineer-skyvera-remote-%2420-000-year-usd-at-crossover-3764112734",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Java Software Engineer, Skyvera (Remote) - $40,000/year USD",
    "company": "Crossover",
    "location": "Egypt",
    "description": "Crossover is the world's #1 source of full-time remote jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Skyvera. Have you got what it takes?<br><br>Are you an elite Java developer with an appetite for complex challenges? Do you aspire to drive change in a rapidly advancing industry? Skyvera is seeking a Java expert with a blend of technical mastery and passion for innovation in the telecommunications sector.<br><br>The telco industry is often reluctant to embrace new technologies. At Skyvera, we are breaking this barrier. Our mission is to pioneer new, cloud-first solutions that redefine how telecom services operate. In this role, you'll be a crucial player in this transformation, leveraging your expertise to develop advanced Java-based applications and guide our product portfolio into a new era of technological excellence.<br><br>This role extends beyond individual contributions - you'll be an integral part of a team that values forward-thinking and shared success. You'll mentor a global team of Java coders, providing them with technical guidance, nurturing their growth, and getting them up to speed with exceptional deliveries. Here, your contributions will shape the future of telecom software solutions.<br><br>We invite you to bring your enthusiasm, creativity, and expert knowledge to Skyvera. If you're ready to be part of a team that's setting new standards, apply now and join us on this exciting journey!<br><br><strong>What You Will Be Doing<br><br></strong><ul><li>Actively engaging in hands-on development, translating complex requirements into efficient, robust Java-based applications</li><li>Using your expertise to guide the team to meet delivery commitments, ensuring high-quality software releases</li><li>Contributing to solution and architecture design while managing maintenance and support to ensure client satisfaction<br><br></li></ul><strong>What You Won’t Be Doing<br><br></strong><ul><li>Getting overwhelmed by routine maintenance overshadowing the opportunity to work on innovative projects</li><li>Working in isolation - you’ll collaborate within a team-centric environment, sharing knowledge and expertise</li><li>Being stuck with outdated technologies - we prioritize staying at the cutting edge of Java and cloud technologies<br><br></li></ul><strong>Basic Requirements<br><br></strong><strong>Java Software Engineer key responsibilities<br><br></strong><ul><li>At least 4 years of professional experience as a Java developer (excluding university courses)</li><li>Knowledge of Object-Oriented Programming (OOP) patterns and concepts</li><li>Familiarity with J2EE, ZK Framework, AngularJS, SOAP, and REST<br><br></li></ul><strong>About Skyvera<br><br></strong>Skyvera maintains your legacy, on-premise software, while reimagining its cloud-native future.<br><br>There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!<br><br><strong>Working with Crossover<br><br></strong>This is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover. The compensation level for this role is $20 USD/hour, which equates to $40,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.<br><br><strong>What to expect next:<br><br></strong><ul><li>You will receive an email with a link to start your self-paced, online job application.</li><li>Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.<br><br></li></ul><strong>Important!</strong> If you do not receive an email from us:<br><br><ul><li>First, emails may take up to 15 minutes to send, refresh and check again.</li><li>Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.</li><li>Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.</li><li>If all else fails, just reset your password by visiting https://www.crossover.com/auth/password-recovery if you already applied using LinkedIn EasyApply.<br><br></li></ul>Crossover Job Code: LJ-5168-EG-Cairo-JavaSoftwareEn<br><br>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/java-software-engineer-skyvera-remote-%2440-000-year-usd-at-crossover-3764109644",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Senior PHP Developer",
    "company": "Techy Business Services",
    "location": "Egypt",
    "description": "<p><strong>Job brief</strong></p><p><span>We are looking for a full-time remote PHP Developer who is dedicated to the&nbsp;craft, writes code that they are&nbsp;proud of and can hit the ground running.</span></p><p><span>A talented PHP Developer to manage our back-end services and ensure a seamless interchange of data between the server and our users. As a PHP Developer, you will be responsible for developing and coding all server-side logic. You will also be required to maintain the central database and respond to requests from front-end developers.</span></p><p><span>To ensure success as a PHP Developer, you should have in-depth knowledge of object-oriented PHP programming, understanding of MVC designs, and working knowledge of front-end technologies including HTML5, JavaScript, and CSS3. Ultimately, a top-level PHP Developer can design and build efficient PHP modules while seamlessly integrating front-end technologies.</span></p><p><span>&nbsp;</span></p><p><strong>What does a PHP Developer do?</strong></p><p><br></p><p><span>A PHP Developer&nbsp;writes beautiful, fast PHP to a high standard, in a timely and scalable way that improves the code-base of our products in meaningful ways.</span></p><p><span>You will be a part of a full-stack creative team that is responsible for all aspects of the ongoing software development from the initial specification, through to developing, testing and launching.</span></p><p><br></p><p><strong>Responsibilities</strong></p><ul><li>Write “clean”, well-designed code</li><li>Produce detailed specifications</li><li>Troubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality</li><li>Contribute in all phases of the development lifecycle</li><li>Follow industry best practices</li><li>Develop and deploy new features to facilitate related procedures and tools if necessary</li><li>Conducting analysis of website and application requirements.</li><li>Writing back-end code and building efficient PHP modules.</li><li>Developing back-end portals with an optimized database.</li><li>Troubleshooting application and code issues.</li><li>Integrating data storage solutions.</li><li>Responding to integration requests from front-end developers.</li><li>Finalizing back-end features and testing web applications.</li><li>Updating and altering application features to enhance performance.</li><li>Writing developer documents to have developer user manuals.</li><li>Updating, repairing, modifying, and developing existing software and generic web applications.</li></ul><p><br></p><p><strong>Requirements and skills</strong></p><ul><li>Proven software development experience in PHP</li><li>Understanding and proven experience of open-source projects and frameworks (Laravel Development and Similar Frameworks)</li><li>Demonstrable knowledge of web technologies including HTML, CSS, Javascript, AJAX etc</li><li>Good knowledge of relational databases, version control tools and of developing web services</li><li>Experience in common third-party APIs integration (Google, Facebook, Ebay etc)</li><li>Solid technical understanding of RESTful API’s</li><li>Passion for best design and coding practices and a desire to develop new bold ideas</li><li>4+ years of experience in web development and software design</li><li>Strong knowledge of front-end technologies including CSS3, JavaScript, and HTML5.</li><li>Understanding of object-oriented PHP programming.</li><li>Previous experience creating scalable applications.</li><li>Proficient with code versioning tools including Git, Mercurial, CVS, and SVN.</li><li>Excellent knowledge of SQL/NoSQL databases.</li><li>Ability to project manage.</li><li>Good problem-solving skills.</li><li><span>Comfortable working in an English-speaking &amp; agile environment</span></li><li><span>Ability to meet deadlines, identify issues, and resolve with minimal direction.</span></li><li><span>Must be self-motivated and able to work both independently and in conjunction with team members and product groups.</span></li><li><span>Strong knowledge and solid experience with Python and Nodejs are a plus.</span></li><li><span>Progressive Web Apps development is a plus.</span></li><li><span>Mobile app development is a plus.</span></li><li><span>UI/UX experience is a plus.</span></li></ul><p><span>&nbsp;</span></p><p><strong>What you get</strong></p><p><strong>&nbsp;</strong></p><ul><li><span>Competitive salary.</span></li><li><span>Working in a cross-border fast growing environment.</span></li><li><span>Fully remote position.</span></li><li><span>Bonuses paid in regular basis after probation period.</span></li><li><span>Internet allowance.</span></li></ul><p><span>&nbsp;</span></p><p><span>&nbsp;</span></p><p><span>If you are interested to join the team, please send you updated C.V and your previous projects portfolio by email to </span>people@techybusinessservices.co.uk<span> to be considered by our team. (Please make sure you write </span><strong>“PHP Developer Vacancy”</strong><span> as the subject line.</span></p>",
    "level": "other",
    "application": "https://eg.linkedin.com/jobs/view/senior-php-developer-at-techy-business-services-3763159754",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Software Developer (Angular and .NET Core) - Project Based - 6 Months",
    "company": "Misr Technology Services",
    "location": "Egypt",
    "description": "<strong>Job Responsibilities:<br><br></strong><ul><li>Design, develop, and maintain robust and scalable modules for the Smart Letters System (SLS).</li><li>Collaborate with cross-functional teams to gather and analyze system requirements.</li><li>Ensure high performance and responsiveness of applications.</li><li>Troubleshoot, debug, and optimize code to address system issues.<br><br></li></ul><strong>Job Requirements:<br><br></strong><ul><li>Proven expertise in Angular and .NET Core development.</li><li>Hands-on experience with API integrations.</li><li>Proficiency in front-end technologies such as HTML, CSS, and JavaScript.</li><li>Solid understanding of database technologies, preferably with experience in SQL.</li><li>Familiarity with agile development methodologies.<br><br></li></ul>Powered by JazzHR<br><br>IneByLOiXa",
    "level": "mid-level",
    "application": "https://eg.linkedin.com/jobs/view/software-developer-angular-and-net-core-project-based-6-months-at-misr-technology-services-3766102614",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Senior Web Developer, Skyvera (Remote) - $40,000/year USD",
    "company": "Crossover",
    "location": "Egypt",
    "description": "Crossover is the world's #1 source of full-time remote jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Skyvera. Have you got what it takes?<br><br>Skyvera is searching for a PHP expert who thrives in fast-paced environments and is eager to drive technological advancements in the telecommunications industry. This role is ideal for someone who excels in PHP development and is passionate about leading teams towards innovation.<br><br>The telco industry often suffers from the slow pace of adopting new technologies and methodologies. At Skyvera, we distinguish ourselves by rapidly embracing and implementing the latest cloud and PHP technologies. As our subject matter expert, you will be a catalyst in accelerating this shift, moving away from conventional development processes to more agile, efficient practices.<br><br>Your role will involve leading the development and delivery of cutting-edge PHP solutions both in front-end and back-end services. Your expertise in PHP development will not only contribute to the creation of advanced software solutions, but also drive the strategic direction of our product offerings. You'll play a pivotal role in ensuring our solutions align with client needs and industry trends.<br><br>Joining Skyvera means becoming part of a dynamic, forward-thinking company where innovative ideas are valued and professional growth is encouraged. If you're ready to join us in transforming the telco domain, apply now!<br><br><strong>What You Will Be Doing<br><br></strong><ul><li>Spearheading the development of customer-facing UIs and back-end services using PHP, ensuring scalable and efficient solutions</li><li>Taking ownership of end-to-end project delivery, working closely with cross-functional Agile teams</li><li>Guiding and mentoring a talented engineering team, promoting the use of best practices and fostering a culture of technical excellence<br><br></li></ul><strong>What You Won’t Be Doing<br><br></strong><ul><li>Being confined to outdated technologies - we prioritize modern, cloud-based solutions</li><li>Working in silos - you’ll be part of a dynamic team that thrives on collaborative efforts<br><br></li></ul><strong>Basic Requirements<br><br></strong><strong>Senior Web Developer key responsibilities<br><br></strong><ul><li>At least 4 years of professional experience in PHP development</li><li>Familiarity with front-end technologies (HTML5, JavaScript, CSS3) and MySQL</li><li>The ability to integrate applications with third-party services using REST APIs with formats like JSON and XML<br><br></li></ul><strong>About Skyvera<br><br></strong>Skyvera maintains your legacy, on-premise software, while reimagining its cloud-native future.<br><br>There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!<br><br><strong>Working with Crossover<br><br></strong>This is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover. The compensation level for this role is $20 USD/hour, which equates to $40,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.<br><br><strong>What to expect next:<br><br></strong><ul><li>You will receive an email with a link to start your self-paced, online job application.</li><li>Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.<br><br></li></ul><strong>Important!</strong> If you do not receive an email from us:<br><br><ul><li>First, emails may take up to 15 minutes to send, refresh and check again.</li><li>Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.</li><li>Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.</li><li>If all else fails, just reset your password by visiting https://www.crossover.com/auth/password-recovery if you already applied using LinkedIn EasyApply.<br><br></li></ul>Crossover Job Code: LJ-5169-EG-Cairo-SeniorWebDevel<br><br>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/senior-web-developer-skyvera-remote-%2440-000-year-usd-at-crossover-3764111851",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Kernel Resilience Engineer - Canonical Ubuntu",
    "company": "Canonical",
    "location": "Egypt",
    "description": "Canonical is building a Kernel Resilience team to harden the Ubuntu kernel. This team will drive proactive efforts to exercise and stretch the stability, reliability, and security of the kernel. Kernel Resilience takes responsibility for the overall quality of the Linux kernel, through aggressive test frameworks and regimens, hardening the kernel against exploits and vulnerabilities, as well as building and maintaining a highly automated kernel build and test infrastructure. We have access to a very large array of hardware, and we would like to keep it busy!<br><br>This is not a role for button pushers to monitor results! We will select candidates who make it their mission to crash or penetrate the kernel, and then drive the eventual resolution of discovered issues. You will be expected to raise the bar on industry best practices, to push the limits of possibility on proactive, gloves-off stress testing.<br><br>The successful candidate will have experience covering some combination of Linux kernel development, quality assurance, security exploits, and back-end development. You may be a seasoned kernel developer looking for a new challenge in back-end automation. You may always have wanted to 'go deeper' into the kernel? Curiosity and a desire to 'poke it and see what happens' will be essential for this role.<br><br>What your day will look like<br><br><ul><li>Work with bleeding edge and early access systems and hardware</li><li>Ensure an ongoing commitment to industry-leading quality, reliability and security standards</li><li>Proactively identify security and stability issues by devising ingenious new ways to break the Linux kernel</li><li>Contribute to the development of an advanced Linux kernel build service</li><li>Engage with other teams at Canonical, the open source community and commercial partners</li><li>Work from home with global travel up to 20% for internal and external events<br><br></li></ul>What we are looking for in you<br><br><ul><li>Innovative out-of-the-box style thinker not afraid to break things</li><li>Significant programming experience in Python, with strong C skills highly regarded</li><li>Ability to communicate effectively in English, both written and oral</li><li>Someone with high standards for overall quality, and not afraid to ensure they are met</li><li>At ease working in several different technical domains concurrently</li><li>Substantial experience in Linux system configuration, customization, and deployment</li><li>Solid understanding Linux kernel internals and development principles</li><li>Deep knowledge of security as it relates to the Linux kernel</li><li>Productive in a globally distributed team through self-discipline and self-motivation, delivering on time</li><li>Contributed to an open source project in the past</li><li>Understanding of agile software development methodologies</li><li>Knowledge of functional safety and/or automotive and industrial standards would be highly regarded<br><br></li></ul>What we offer you<br><br>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.<br><br>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.<br><br><ul><li>Fully remote working environment - we've been working remotely since 2004!</li><li>Personal learning and development budget of 2,000USD per annum</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Parental Leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues at 'sprints'</li><li>Priority Pass for travel and travel upgrades for long haul company events<br><br></li></ul><strong>About Canonical<br><br></strong>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.<br><br>Canonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.<br><br>Canonical is an equal opportunity employer<br><br>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br><br>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/kernel-resilience-engineer-canonical-ubuntu-at-canonical-3763979594",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Kernel Resilience Engineer - Canonical Ubuntu",
    "company": "Canonical",
    "location": "Egypt",
    "description": "Canonical is building a Kernel Resilience team to harden the Ubuntu kernel. This team will drive proactive efforts to exercise and stretch the stability, reliability, and security of the kernel. Kernel Resilience takes responsibility for the overall quality of the Linux kernel, through aggressive test frameworks and regimens, hardening the kernel against exploits and vulnerabilities, as well as building and maintaining a highly automated kernel build and test infrastructure. We have access to a very large array of hardware, and we would like to keep it busy!<br><br>This is not a role for button pushers to monitor results! We will select candidates who make it their mission to crash or penetrate the kernel, and then drive the eventual resolution of discovered issues. You will be expected to raise the bar on industry best practices, to push the limits of possibility on proactive, gloves-off stress testing.<br><br>The successful candidate will have experience covering some combination of Linux kernel development, quality assurance, security exploits, and back-end development. You may be a seasoned kernel developer looking for a new challenge in back-end automation. You may always have wanted to 'go deeper' into the kernel? Curiosity and a desire to 'poke it and see what happens' will be essential for this role.<br><br>What your day will look like<br><br><ul><li>Work with bleeding edge and early access systems and hardware</li><li>Ensure an ongoing commitment to industry-leading quality, reliability and security standards</li><li>Proactively identify security and stability issues by devising ingenious new ways to break the Linux kernel</li><li>Contribute to the development of an advanced Linux kernel build service</li><li>Engage with other teams at Canonical, the open source community and commercial partners</li><li>Work from home with global travel up to 20% for internal and external events<br><br></li></ul>What we are looking for in you<br><br><ul><li>Innovative out-of-the-box style thinker not afraid to break things</li><li>Significant programming experience in Python, with strong C skills highly regarded</li><li>Ability to communicate effectively in English, both written and oral</li><li>Someone with high standards for overall quality, and not afraid to ensure they are met</li><li>At ease working in several different technical domains concurrently</li><li>Substantial experience in Linux system configuration, customization, and deployment</li><li>Solid understanding Linux kernel internals and development principles</li><li>Deep knowledge of security as it relates to the Linux kernel</li><li>Productive in a globally distributed team through self-discipline and self-motivation, delivering on time</li><li>Contributed to an open source project in the past</li><li>Understanding of agile software development methodologies</li><li>Knowledge of functional safety and/or automotive and industrial standards would be highly regarded<br><br></li></ul>What we offer you<br><br>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.<br><br>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.<br><br><ul><li>Fully remote working environment - we've been working remotely since 2004!</li><li>Personal learning and development budget of 2,000USD per annum</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Parental Leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues at 'sprints'</li><li>Priority Pass for travel and travel upgrades for long haul company events<br><br></li></ul><strong>About Canonical<br><br></strong>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.<br><br>Canonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.<br><br>Canonical is an equal opportunity employer<br><br>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br><br>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/kernel-resilience-engineer-canonical-ubuntu-at-canonical-3763983299",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "5G Undergraduate Intern Software Engineer",
    "company": "Dell Technologies",
    "location": "Egypt",
    "description": "From applied research to advanced engineering, Dell’s 5G R&amp;D team is designing and developing ground-breaking products &amp; solutions. You will be involved in assessing the market, developing technology and products and generating intellectual property. Your contributions will drive product architecture and implementation in support of building something from the ground up, all while working with colleagues across the globe to ensure Dell products always lead the way.<br><br>We are looking for a <strong>5G Software Engineer Undergraduate Intern</strong> to join our creative talented team. Candidates should come with willingness to learn and explore different technologies.<br><br><strong>Why Work For Us:<br><br></strong>Dell is more than a technology company — we are a people company. We inspire, challenge and respect every one of our over 100,000 employees all over the world providing them with unparalleled growth and development opportunities. Dell is primed to recruit the best and brightest candidates taking pride in fostering a winning, innovative, inclusive employee culture. We also take calculated risks and we celebrate big victories when they pay off.<br><br><strong>Responsibilities:<br><br></strong><strong>What you’ll achieve:<br><br></strong>As a <strong>5G Software Engineer Undergraduate Intern</strong>, you will work with a cross functional global team to design, build and deliver production ready software with Dell standards. You will work on a product that is adding intelligence and machine learning to the RAN which is a new edge and a huge differentiator for 5G networks. As part of the 5G team, you will work in collaboration with multiple teams around the world.<br><br>You Will:<br><br><ul><li>Participate in project lifecycle from requirements gathering and implementation to project delivery</li><li>Work closely with cross functional stakeholders to present updates and understand new requirements</li><li>Collaborate with different Engineering teams at Dell Technologies</li><li>Develop high quality, reliable and maintainable code</li><li>Be a part of a microservices solution using cutting edge technologies</li><li>Be agile and retrospective, and not afraid to identify what we’re doing wrong so we can fix it, and what we’re doing right so we can improve on it <br><br></li></ul><strong>Take the first step towards your dream career<br><br></strong>Every Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:<br><br><strong>Essential Requirements:<br><br></strong><ul><li>University Students, majoring in Computer Science or similar discipline</li><li>Well rounded in one or more of the following programming languages: Java, C++, Python, Go or JavaScript</li><li>Good object oriented principles knowledge</li><li>Understand REST, databases design &amp; Microservices Architecture</li><li>Familiar with Git<br><br></li></ul><strong>Desirable Requirements:<br><br></strong><ul><li>Networking knowledge</li><li>Understanding of Virtualization and Containerization</li><li>Contributions to large open source projects<br><br></li></ul><strong>Application closing date: </strong>23 November 2023<br><br>Dell Technologies is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. Read the full Equal Employment Opportunity Policy here.<br><br><strong>Job ID:</strong>R228340<br><br><strong>Dell’s Flexible &amp; Hybrid Work Culture<br><br></strong>At Dell Technologies, we believe our best work is done when flexibility is offered.<br><br>We know that freedom and flexibility are crucial to all our employees no matter where you are located and our flexible and hybrid work style allows team members to have the freedom to ideate, be innovative, and drive results their way. To learn more about our work culture, please visit our locations page.<br><br>Job Id: R228340<br><br>Job Function: Interns",
    "level": "other",
    "application": "https://eg.linkedin.com/jobs/view/5g-undergraduate-intern-software-engineer-at-dell-technologies-3765883531",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Software Engineer, Skyvera (Remote) - $40,000/year USD",
    "company": "Crossover",
    "location": "Egypt",
    "description": "Crossover is the world's #1 source of full-time remote jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Skyvera. Have you got what it takes?<br><br>Skyvera is searching for a PHP expert who thrives in fast-paced environments and is eager to drive technological advancements in the telecommunications industry. This role is ideal for someone who excels in PHP development and is passionate about leading teams towards innovation.<br><br>The telco industry often suffers from the slow pace of adopting new technologies and methodologies. At Skyvera, we distinguish ourselves by rapidly embracing and implementing the latest cloud and PHP technologies. As our subject matter expert, you will be a catalyst in accelerating this shift, moving away from conventional development processes to more agile, efficient practices.<br><br>Your role will involve leading the development and delivery of cutting-edge PHP solutions both in front-end and back-end services. Your expertise in PHP development will not only contribute to the creation of advanced software solutions, but also drive the strategic direction of our product offerings. You'll play a pivotal role in ensuring our solutions align with client needs and industry trends.<br><br>Joining Skyvera means becoming part of a dynamic, forward-thinking company where innovative ideas are valued and professional growth is encouraged. If you're ready to join us in transforming the telco domain, apply now!<br><br><strong>What You Will Be Doing<br><br></strong><ul><li>Spearheading the development of customer-facing UIs and back-end services using PHP, ensuring scalable and efficient solutions</li><li>Taking ownership of end-to-end project delivery, working closely with cross-functional Agile teams</li><li>Guiding and mentoring a talented engineering team, promoting the use of best practices and fostering a culture of technical excellence<br><br></li></ul><strong>What You Won’t Be Doing<br><br></strong><ul><li>Being confined to outdated technologies - we prioritize modern, cloud-based solutions</li><li>Working in silos - you’ll be part of a dynamic team that thrives on collaborative efforts<br><br></li></ul><strong>Basic Requirements<br><br></strong><strong>Software Engineer key responsibilities<br><br></strong><ul><li>At least 4 years of professional experience in PHP development</li><li>Familiarity with front-end technologies (HTML5, JavaScript, CSS3) and MySQL</li><li>The ability to integrate applications with third-party services using REST APIs with formats like JSON and XML<br><br></li></ul><strong>About Skyvera<br><br></strong>Skyvera maintains your legacy, on-premise software, while reimagining its cloud-native future.<br><br>There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!<br><br><strong>Working with Crossover<br><br></strong>This is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover. The compensation level for this role is $20 USD/hour, which equates to $40,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.<br><br><strong>What to expect next:<br><br></strong><ul><li>You will receive an email with a link to start your self-paced, online job application.</li><li>Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.<br><br></li></ul><strong>Important!</strong> If you do not receive an email from us:<br><br><ul><li>First, emails may take up to 15 minutes to send, refresh and check again.</li><li>Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.</li><li>Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.</li><li>If all else fails, just reset your password by visiting https://www.crossover.com/auth/password-recovery if you already applied using LinkedIn EasyApply.<br><br></li></ul>Crossover Job Code: LJ-5169-EG-Cairo-SoftwareEngine<br><br>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/software-engineer-skyvera-remote-%2440-000-year-usd-at-crossover-3764113132",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Undergraduate Intern, Software Quality Engineer",
    "company": "Dell Technologies",
    "location": "Egypt",
    "description": "<strong>Undergraduate Intern, Software Quality Engineer<br><br></strong>From applied research to advanced engineering, Dell’s Technology Development team is designing and developing ground-breaking projects. You will be part of a unique team that gets to work on different projects with a vast variety of cutting-edge technologies. Working at Dell Technologies, you will gain access on endless learning resources and great opportunities to develop your technical and interpersonal skills.<br><br>We are looking for a <strong>Software Engineer Intern</strong> to join our creative talented team. Candidates should come with the willingness to learn and explore different technologies.<br><br>Join us to take part in a once in a career opportunity to be part of building something from scratch and make a profound impact.<br><br><strong>What you’ll achieve:<br><br></strong>As a <strong>Software Engineer intern, </strong>you will work with a cross functional global team to design, build and deliver production ready software with Dell standards<strong>.</strong> <br><br><strong>You Will:<br><br></strong><ul><li>Develop high quality, reliable Deliverables </li><li>Be part of an agile team, collaboratively realizing features through our software development lifecycle  </li><li>Work closely with cross functional stakeholders to present updates and understand new requirements. </li><li>Collaborate with different Engineering teams at Dell Technologies <br><br></li></ul><strong>Take the first step towards your dream career<br><br></strong>Every Dell Technologies team member brings something unique to the table. Here’s what we are looking for with this role:<br><br><strong>Essential Requirements</strong>:<br><br><ul><li>Familiar with Different Software Testing Types e.g. System Testing , Regression Testing etc. </li><li>Review requirements, specifications documents to provide timely and meaningful feedback. </li><li>Create well-structured test plans and test cases. </li><li>Estimate, prioritize, plan and coordinate testing activities. </li><li>Identify, record, document thoroughly and track bugs. </li><li>Exceptional attention to detail </li><li>Excellent analytical and problem-solving skills </li><li>Good oral and written communication skills <br><br></li></ul><strong>Desirable Requirements:<br><br></strong><ul><li>Automation Testing Knowledge <br><br></li></ul> <br><br>We believe that each of us has the power to make an impact. That’s why we put our team members at the center of everything we do. If you’re looking for an opportunity to grow your career with some of the best minds and most advanced tech in the industry, we’re looking for you.<br><br>Dell Technologies is a unique family of businesses that helps individuals and organizations transform how they work, live and play. Join us to build a future that works for everyone because Progress Takes All of Us.<br><br><strong>Application closing date: 23rd</strong> November 2023<br><br><strong>Job ID:</strong>R228339<br><br><strong>Dell’s Flexible &amp; Hybrid Work Culture<br><br></strong>At Dell Technologies, we believe our best work is done when flexibility is offered.<br><br>We know that freedom and flexibility are crucial to all our employees no matter where you are located and our flexible and hybrid work style allows team members to have the freedom to ideate, be innovative, and drive results their way. To learn more about our work culture, please visit our locations page.<br><br>Job Id: R228339<br><br>Job Function: Interns",
    "level": "other",
    "application": "https://eg.linkedin.com/jobs/view/undergraduate-intern-software-quality-engineer-at-dell-technologies-3762720549",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Senior Software Engineer",
    "company": "Namaa For Engineering Consultations",
    "location": "Egypt",
    "description": "<p><strong>We are hiring Senior Software Engineer</strong></p><p><br></p><p><strong>Requirements:</strong></p><ul><li>Bachelor's or Master's degree in Computer Science, Software Engineering, or a related field.</li><li>+5 years experience</li><li>Strong proficiency in Angular (TypeScript, HTML, CSS, Angular Material).</li><li>Expertise in .NET (C#, ASP.NET, Entity Framework).</li><li>Solid understanding of cloud computing concepts.</li><li>Experience with cloud platforms like AWS, Azure, or Google Cloud.</li><li>Familiarity with containerization technologies (Docker) and orchestration tools (Kubernetes).</li><li>Strong knowledge of RESTful API design principles.</li><li>Agile/Scrum experience.</li><li>Excellent problem-solving skills.</li><li>Strong communication and collaboration abilities.</li></ul><p><br></p><p><strong>Work Condition:</strong></p><ul><li>Location: Dokki</li><li>Working hours: (9)</li><li>Working Days: (5)</li></ul><p> </p><p>For interested talented candidate, kindly send your updated CV to jobs@namaaconsult.com , mention the Job title (Senior Software Engineer) in the subject line</p>",
    "level": "other",
    "application": "https://eg.linkedin.com/jobs/view/senior-software-engineer-at-namaa-for-engineering-consultations-3759785103",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Software Developer, Skyvera (Remote) - $30,000/year USD",
    "company": "Crossover",
    "location": "Egypt",
    "description": "Crossover is the world's #1 source of full-time remote jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Skyvera. Have you got what it takes?<br><br>Are you a tech-savvy engineer with a knack for managing complex IT environments? If so, Skyvera has an exciting opportunity for you!<br><br>At Skyvera, we are pioneering the future of telecommunications software solutions, and we're on a mission to lead the industry into the era of public cloud technology. To achieve this vision, we are assembling a team of experts who possess a deep understanding of our technical landscape and a relentless drive to learn and adapt.<br><br>As a key member of our team, you will be responsible for customizing and implementing solutions for a major telecom client and fine-tuning software performance. Your contributions will be instrumental in exploring innovative system configurations and fostering a culture of continuous improvement.<br><br>This is a unique opportunity for individuals who enjoy solving complex problems and aspire to make a meaningful impact on the telecommunications landscape. Join us, and let's shape the future of the industry together!<br><br><strong>What You Will Be Doing<br><br></strong><ul><li>Customize and implement products for a major telecommunications client</li><li>Measure and analyze software performance<br><br></li></ul><strong>What You Won’t Be Doing<br><br></strong><ul><li>Spending endless hours on repetitive and non-impactful tasks</li><li>Operating in isolation without collaborative support<br><br></li></ul><strong>Software Developer Key Responsibilities<br><br></strong><ul><li>Ensuring consistent system operations and software applications are running at peak performance<br><br></li></ul><strong>Basic Requirements<br><br></strong><ul><li>At least 2 years of experience supporting large scale IT environments in the telecommunications industry</li><li>Excellent Linux skills<br><br></li></ul><strong>About Skyvera<br><br></strong>Skyvera maintains your legacy, on-premise software, while reimagining its cloud-native future.<br><br>There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!<br><br><strong>Working with Crossover<br><br></strong>This is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover. The compensation level for this role is $15 USD/hour, which equates to $30,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.<br><br><strong>What to expect next:<br><br></strong><ul><li>You will receive an email with a link to start your self-paced, online job application.</li><li>Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.<br><br></li></ul><strong>Important!</strong> If you do not receive an email from us:<br><br><ul><li>First, emails may take up to 15 minutes to send, refresh and check again.</li><li>Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.</li><li>Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.</li><li>If all else fails, just reset your password by visiting https://www.crossover.com/auth/password-recovery if you already applied using LinkedIn EasyApply.<br><br></li></ul>Crossover Job Code: LJ-5156-EG-Cairo-SoftwareDevelo.002<br><br>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/software-developer-skyvera-remote-%2430-000-year-usd-at-crossover-3764107870",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Service Engineer",
    "company": "Atlas Copco",
    "location": "Egypt",
    "description": "<strong>Passionate people create exceptional things<br><br></strong>Did you know that the solutions we develop are a key part of most industries? Electronics, medical research, renewable energy, food production, infrastructure and many more.<br>We´re everywhere! Working with us means working with the latest technologies and groundbreaking, sustainable innovations. With our inclusive and caring environment, you get the support and inspiration you need to grow.<br>Here, your ideas are embraced, and you never stop learning. Interested in being part of our team?<br><br><strong>Join us on our journey for a better tomorrow.<br><br></strong><strong>Your Role<br><br></strong>The role of Service Engineer is to provide service for various PT products at workshops and customer sites, ensuring Atlas Copco standards are always upheld.<br>The role will report to the Regional Operations Manager and will be located in Cairo, Egypt.<br>The main responsibilities of the role are:<br><br><ul><li> Effectively diagnose electrical and mechanical faults on customers' equipment.</li><li> Commissioning of all PT-related products.</li><li> Overhauling and repairing of customers equipment.</li><li> Conducting preventative maintenance work.</li><li> Assisting in planning and organizing daily and weekly visit schedules.</li><li> Always Apply engineering “best practice”.</li><li> Maintaining tools and test instruments to ensure they remain in good condition.</li><li> Delivering feedback from the site to the Spare Parts and Service Sales Team.</li><li> Fostering a strong relationship with the local customer base.</li><li> Be aware of, and apply, Health and Safety regulations in the Service Centre and on site.</li><li> Effectively always promote the Atlas Copco company image.</li><li> Use all resources and attend training to develop knowledge and skills.</li><li> Perform additional related duties as required.<br><br><br></li></ul><strong>To succeed, you will need <br><br></strong><strong>Skills<br><br></strong><ul><li>Advanced problem-solving skills.</li><li>Well-organized and able to multi-task.</li><li>Good interpersonal and customer care skills.</li><li>Customer-oriented attitude. </li><li>Well-developed communication skills at all levels of the organization.<br><br><br></li></ul><strong>Essential<br><br></strong><strong>Experience and knowledge requirements<br><br></strong><ul><li>Solid knowledge of engineering principles and procedures.</li><li>Solid knowledge of product functions and parts.<br><br><br></li></ul><strong>Desirable<br><br></strong><ul><li>Hands-on experience with air compressors.</li><li>Hands-on experience with lighting towers, generators, and pumps. </li><li>Knowledge of electrical drawings and circuits.</li><li>Good English language skills, both written and verbal.<br><br><br></li></ul><strong>In return, we offer you<br><br></strong>You will join a successful and motivated team and have the opportunity to develop your knowledge and skills in a rewarding role.<br><br><strong>City<br><br></strong>Cairo<br><br><strong>Recruiter<br><br></strong>[email protected]<br><br><strong>Hiring Manager<br><br></strong>Haytham Mohamed Khamis<br><br><strong>Last Day to Apply<br><br></strong>16 November 2023<br><br><strong>Diverse by nature and inclusive by choice<br><br></strong>Bright ideas come from all of us. The more unique perspectives we embrace, the more innovative we are. Together we build a culture where difference is valued and we share a deep sense of purpose and belonging.",
    "level": "other",
    "application": "https://eg.linkedin.com/jobs/view/service-engineer-at-atlas-copco-3760301168",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Junior PS Engineer",
    "company": "Connect Digital Solutions",
    "location": "Egypt",
    "description": "<p><strong>Job Description</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Install Products, Demos &amp; POCs at customers’ sites, collaborate effectively with PS and SW engineers to learn about the products and how to configure them in test labs and at customer sites, be part of a 24x7 technical support team as needed.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Accountabilities</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Install, upgrade and configure products, Demos &amp; POCs in the Engineering lab and at customer sites.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Actively test functional and system performance as per acceptance document.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Troubleshoot all hardware and software problems needed for installation.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Troublshouting network connectivity’s issues</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Hands on Windows Server services like DNS, AD, LDAP and FTP.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Hands on MS SQL servers’ installations and basic SQL administrations like (Run scripts, Backup/restore DB, SQL replications)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Hands on VMware, ESXI and Hyper-V</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Familiar with web servers like IIS, Apache tomcat or WebSphere</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Escalate all observed incidents, irregularities that occur to senior PS engineer. </p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Deliver final application up and running as per the acceptance document.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Conduct technical training for the clients to provide all technical information needed.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Review checklist of the acceptance document with the customer and get the customer signature.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Write accurate professional reports on technical issues.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Troubleshoot all hardware and software problems needed for customer support as per SLA.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Provide technical support 24/7 when needed.</p><p><strong>Specific Requirements:</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>1-2 Years of professional services or related experience.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Bachelor's degree in computer engineering, information technology, computer science or a related discipline.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Advanced operating systems background.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Basic Understanding of computer networks. </span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Advanced HW/SW Installation.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Basic knowledge in database administration.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Basic knowledge in telecommunication and VOIP is a plus.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Documentation skills along with process knowledge.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Coordinating and organizing skills along with time management.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Must have good communication skills (both verbal and well-versed writing).</span></p>",
    "level": "other",
    "application": "https://eg.linkedin.com/jobs/view/junior-ps-engineer-at-connect-digital-solutions-3765853047",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Senior Android Developer",
    "company": "Koinz",
    "location": "Egypt",
    "description": "<strong>Role Brief:<br><br></strong>As a Senior Android Software Engineer at Koinz, you will play a key role in the development and enhancement of our flagship Android application. You will collaborate closely with product managers, designers, and cross-functional teams to translate business requirements into innovative and high-quality Android solutions. With your expertise in Android development, you will design, develop, and maintain robust and scalable applications that deliver seamless customer experiences.<br><br>In this role, you will be responsible for writing clean and efficient code using Java and Kotlin, implementing and maintaining application architecture, conducting thorough code reviews, and resolving technical challenges. Your deep understanding of Android architecture components, UI/UX principles, and modern development frameworks will enable you to create visually appealing and intuitive user interfaces.<br><br>As a Senior Android Software Engineer, you will also mentor and guide junior team members, contributing to their growth and development. To excel in this role, you should have a solid foundation in Android application development, strong programming skills in Java and Kotlin, and experience with Android SDK and related tools. You should be familiar with industry best practices, have a keen eye for detail, and possess a passion for delivering high-quality software solutions. Strong problem-solving skills, effective communication, and the ability to work collaboratively in an Agile environment are essential for success.<br><br><strong>What you will be working on here in Koinz:<br><br></strong><ul><li>Contributing in Android application development cycle including system architecture, module design, and quality assurance. </li><li>Implement complex designs into reliable, reusable and readable code.</li><li>Use best engineering practices and automated continuous integration and delivery within an Agile environment. </li><li>Participate in validating user requirements, estimating the needed efforts and setting release plans.</li><li>Unit-test code for robustness, including edge cases, usability, and general reliability.</li><li>Work on bug fixing and improving application performance.</li><li>Continuously discover, evaluate, and implement new technologies to maximize development efficiency.<br><br></li></ul><strong>What you will need to fit in this position:<br><br></strong><ul><li>Bachelor's degree in Computer Science, Software Engineering, or a related field.</li><li>Minimum of 5 years of professional experience in Android application development, with a strong portfolio showcasing successful Android applications.</li><li>Extensive experience with Java and Kotlin programming languages, Android SDK, and Android Studio.</li><li>Strong understanding of Android architecture components, including activities, fragments, services, and broadcast receivers.</li><li>Proficient in using modern Android development frameworks and libraries, such as Jetpack, Dagger, RxJava, and Retrofit.</li><li>Deep understanding of UI/UX principles and ability to create visually appealing and intuitive user interfaces.</li><li>Solid knowledge of software engineering principles, including object-oriented programming, design patterns, and data structures.</li><li>Experience with version control systems, such as Git, and familiarity with continuous integration and deployment pipelines.</li><li>Proven ability to work in an Agile development environment, collaborating with cross-functional teams and delivering high-quality software within deadlines.</li><li>Excellent problem-solving skills, with the ability to analyze complex technical issues and propose effective solutions.</li><li>Strong communication and interpersonal skills, with the ability to effectively articulate technical concepts to both technical and non-technical stakeholders.<br><br></li></ul>Powered by JazzHR<br><br>bFQAfKQrrT",
    "level": "mid-level",
    "application": "https://eg.linkedin.com/jobs/view/senior-android-developer-at-koinz-3765386615",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Senior Java Software Engineer",
    "company": "Beetleware",
    "location": "Egypt",
    "description": "<p><strong>Java Software Engineer</strong></p><p>Job description</p><p><br></p><p>We are looking for Senior Software Engineer, Java Backend Focus</p><p>Senior software engineering expert across all phases of the software development lifecycle for</p><p>development of Java web applications and web services.</p><p>Tasks and Responsibilities</p><p>● Collect, document, and analyze requirements from a variety of sources.</p><p>● Design robust, high-performance, low-maintenance, and documented solutions.</p><p>● Produce high-quality implementations of applications, including writing Java code and SQL queries.</p><p>● Lead and participate in performance and functionality testing of applications.</p><p>● Develop new web applications and web services.</p><p>● Maintain existing applications and services.</p><p>● Customize and extend business process management (BPM) based solutions (e.g. jBPM).</p><p>● Suggest and demonstrate efficient designs &amp; technologies for applications developed by the group.</p><p>● Mentor other less experienced developers.</p><p>Key Technologies</p><p>● Java, Spring Rest, Spring MVC, Spring Data, Spring Boot, JPA, jBPM, web applications, web services, Javascript, React, XML, Tomcat, SQL, PostgreSQL, Jira, Bitbucket, git.</p><p>Required Experience</p><p>● 4 years experience MINIMUM building Java-based applications.</p><p>● 4 years experience developing applications using an ORM framework.</p><p>●4 years experience using the Spring Framework, including Spring Boot.</p><p>● 4 years experience producing and analyzing complex SQL queries.</p><p>● 4 years experience with REST web services.</p><p>● 4 years working in an organization deeply adhering to the Scrum methodology.</p><p>● 4 years working in an environment relying upon automated builds and continuous integration.</p><p>● 4 years producing artifacts related to the design of applications, e.g. design documents, UML</p><p>● diagrams, prototypes.</p><p>● 2 years working with Javascript frameworks, e.g. React, Angular, jQuery.</p><p>Required Skills</p><p>● Ability to communicate extremely well. This is absolutely critical for the job since our client is remote, and we are using Scrum.</p><p>● Absolutely excellent understanding of the Java programming language and object oriented principles.</p><p>● Absolutely excellent understanding of relational databases, SQL statements, and JPA.</p><p>● Absolutely excellent understanding of the HTTP protocol and of how REST API's sit upon that. Absolutely excellent communication skills, and ability to influence teams by example.</p><p>● Excellent understanding of key concepts in Java distributed web applications, especially concurrency, exception handling, session management, multi-tier design, and building of API’s.</p><p>● Strong understanding of the software engineering lifecycle, and tools to support it.</p><p>● Strong understanding of automated builds and continuous integration, and supporting tools, e.g. git, gradle, Maven, Jenkins.</p><p>● Strong understanding of software engineering best practices and processes for teams, e.g. Scrum or Kanban.</p><p>● Excellent understanding and deep familiarity based on hands-on usage of concepts such as inversion of control, dependency injection, beans, bean lifecycle, design patterns (Factory, Proxy, MVC, etc.), autowiring, and bean validation.</p><p>● Strong understanding and experience in the design of reliable, high-performance, easily maintainable applications.</p><p>● Strong understanding and proven experience in writing tests at different levels, unit, integration, and otherwise.</p><p>● Strong understanding and awareness of memory usage considerations in design and implementation.</p><p>● Excellent understanding of how to use Spring and Swagger to develop REST-based applications.</p><p>● Highly polished abilities to develop and maintain complex Spring-based applications.</p><p>● Strong understanding of how to administer and configure any leading Java application server, notably Tomcat, Wildfly, or Glassfish.</p><p>● Highly polished abilities to use a leading Java IDE, e.g. Eclipse, IntelliJ.</p><p>● Strong understanding of the official Oracle specifications for servlets, filters, and other web artifacts.</p><p>● Strong understanding and ability to produce scalable applications using Spring MVC and Spring Rest.</p><p>● Strong understanding and ability to support persistence using Spring Data and JPA.</p><p>● Good understanding of SQL databases, PostgreSQL in particular. Excellent ability to create complex SQL queries when needed.</p><p>● Good understanding of caching frameworks such as Redis and memcached.</p><p>● Familiarity with NoSQL databases and their appropriateness for different functions, from full-fledged backend to session caching.</p><p>● Good understanding of single sign on concepts, using different protocols such as SAML, OAuth, and Open Connect in particular</p><p>● Understanding of performance and reliability impacts of design decisions, and ability to design metrics and test applications against those metrics.</p><p>● Good experience and understanding of git or any other distributed version control system (mercurial, bazaar...). Should be intimately familiar with cloning, branching, staging, committing, pushing, and more.</p><p>● Ability to suggest and use proven, popular open source technologies to enhance the productivity of the team and quality of the applications.</p><p>● Good understanding of the Scrum methodology. Should understand the responsibilities of the Product Owner and Development team inside and out.</p><p>● Good understanding of how to use Jira and Bitbucket in support of issue tracking and continuous integration and delivery.</p><p>● Excellent English skills, both written and spoken.</p><p>Required Education</p><p>● MUST have a four-year Bachelor's degree at minimum in Computer Science, Information Systems, or other Information Technology specialization.</p><p>Please Send your CV on: careers@beetleware.com</p>",
    "level": "other",
    "application": "https://eg.linkedin.com/jobs/view/senior-java-software-engineer-at-beetleware-3759797713",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Oracle NetSuite Developer",
    "company": "N/A",
    "location": "Egypt",
    "description": "<p><strong><u>Job Responsibilities:</u></strong></p><ul><li>Use JavaScript, PHP, SQL, among other programming languages to customize the NetSuite system.</li><li>Work with a team to develop, test, and roll-out solutions.</li><li>Work with the clients to demonstrate the scripted solution and assist with any issues.</li><li>Use industry experience, business analysis, and best practices within NetSuite to solve clients’ most complex business problems.</li><li>Perform full NetSuite ERP and CRM implementations, interacting directly with senior-level client personnel and provide client training (on-site and/or web - based) as needed.</li><li>Develop and communicate client requirements with the technical developers on potential product customizations.</li><li>Implement and deploy NetSuite solutions accommodating unique industry, business, and management processes, regulatory requirements, and other business specifications.</li><li>Conduct business process mapping and requirements gathering sessions with new customers.</li></ul><p><strong><u>Job Requirements:&nbsp;</u></strong></p><ul><li>BSc degree in Computer Science, Engineering or any relevant field</li><li>From 0-2 years of experience in NetSuite.</li><li>Experience in creating custom scripts with Suite Script 1.0 &amp; 2.x.</li><li>Experience in JavaScript, HTML, CSS .</li><li>Web services preferred (REST,SOAP)</li><li>Data Management preferred (SQL, JSON, XML)</li><li>PLSQL, Python/Java is a plus.</li></ul><p><br></p>",
    "level": "other",
    "application": "https://eg.linkedin.com/jobs/view/oracle-netsuite-developer-at-n-a-3764168963",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Outsystems Developer 2-5yrs",
    "company": "SupportFinity™",
    "location": "Egypt",
    "description": "<p>Ejada is looking for a Senior Outsystems Developer  </p><p><br></p><p>2-5 years of experience who can carry out the following:</p><p><br></p><p>-     Primary function will be core development of OutSystems web applications in a fast-paced environment using Agile methodology.</p><p>-    The developer will work with a team lead and different business segments both inside and outside of technology departments.</p><p>-    A successful developer will be comfortable interacting with different groups within the technology and within different business areas to understand the User Experience (UX) goals of business requirements, provide clients with pertinent feedback relative to pros/cons of development course and understand how to match existing user interface (UI) guidelines to meet requirements within the OutSystems platform.</p><p>-    Daily activities will include the development of functional components including pages, processes and custom UI in OutSystems.</p><p><br></p><p>Responsibilities</p><p>————————-</p><p>-    Advocate Low Code OutSystems development approach and develop best practices.</p><p>-    Conduct code reviews.</p><p>-    Programming experience of at least 4+ years</p><p>-    Knowledge of databases; Oracle, MySQL, etc.</p><p>-    Knowledge of APIs.</p><p>-    Ability to follow instructions and work in a team environment</p><p>-    Knowledge of HTML, CSS and JavaScript</p><p>-    OutSystems Certification is a bonus</p><p>-    Effective OutSystems development experience for Web and/or Mobile.</p><p><br></p><p>Qualifications</p><p>————————</p><p>-    4+ years of experience in Outsystem development and knowledgeOutSystems Certification: Associate Reactive Developer or Higher</p><p>-    Expert with Integration Studio, Workflow Builder</p><p>-   Knowledge of Agile practices</p><p>-   Egypt-based vacancy but the candidates need to be flexible to travel to KSA (based on the job needs).</p>",
    "level": "other",
    "application": "https://eg.linkedin.com/jobs/view/outsystems-developer-2-5yrs-at-supportfinity%E2%84%A2-3764119560",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Software Engineer, Skyvera (Remote) - $30,000/year USD",
    "company": "Crossover",
    "location": "Egypt",
    "description": "Crossover is the world's #1 source of full-time remote jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Skyvera. Have you got what it takes?<br><br>Are you a tech-savvy engineer with a knack for managing complex IT environments? If so, Skyvera has an exciting opportunity for you!<br><br>At Skyvera, we are pioneering the future of telecommunications software solutions, and we're on a mission to lead the industry into the era of public cloud technology. To achieve this vision, we are assembling a team of experts who possess a deep understanding of our technical landscape and a relentless drive to learn and adapt.<br><br>As a key member of our team, you will be responsible for customizing and implementing solutions for a major telecom client and fine-tuning software performance. Your contributions will be instrumental in exploring innovative system configurations and fostering a culture of continuous improvement.<br><br>This is a unique opportunity for individuals who enjoy solving complex problems and aspire to make a meaningful impact on the telecommunications landscape. Join us, and let's shape the future of the industry together!<br><br><strong>What You Will Be Doing<br><br></strong><ul><li>Customize and implement products for a major telecommunications client</li><li>Measure and analyze software performance<br><br></li></ul><strong>What You Won’t Be Doing<br><br></strong><ul><li>Spending endless hours on repetitive and non-impactful tasks</li><li>Operating in isolation without collaborative support<br><br></li></ul><strong>Software Engineer Key Responsibilities<br><br></strong><ul><li>Ensuring consistent system operations and software applications are running at peak performance<br><br></li></ul><strong>Basic Requirements<br><br></strong><ul><li>At least 2 years of experience supporting large scale IT environments in the telecommunications industry</li><li>Excellent Linux skills<br><br></li></ul><strong>About Skyvera<br><br></strong>Skyvera maintains your legacy, on-premise software, while reimagining its cloud-native future.<br><br>There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!<br><br><strong>Working with Crossover<br><br></strong>This is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover. The compensation level for this role is $15 USD/hour, which equates to $30,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.<br><br><strong>What to expect next:<br><br></strong><ul><li>You will receive an email with a link to start your self-paced, online job application.</li><li>Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.<br><br></li></ul><strong>Important!</strong> If you do not receive an email from us:<br><br><ul><li>First, emails may take up to 15 minutes to send, refresh and check again.</li><li>Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.</li><li>Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.</li><li>If all else fails, just reset your password by visiting https://www.crossover.com/auth/password-recovery if you already applied using LinkedIn EasyApply.<br><br></li></ul>Crossover Job Code: LJ-5156-EG-Cairo-SoftwareEngine.001<br><br>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/software-engineer-skyvera-remote-%2430-000-year-usd-at-crossover-3764111482",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Senior Web Developer",
    "company": "Confidential",
    "location": "Egypt",
    "description": "<p>We are seeking an experienced Senior Developer to join our development team. The Developer will design and write maintainable code, communicate with team members. The ideal candidate should have an eye for clean and artful websites and applications design and development as well as should also have superior user interface design skills.</p><p><br></p><p><br></p><p>** Portfolio and links to previous projects is mandatory to be attached.</p><p><br></p><p><br></p><p>Job Description:</p><p>Responsible for designing and developing web pages and interactive marketing materials as requested in a fast-paced environment.</p><p>Duties included HTML and CSS hand-coding, graphic design, UI design, and coordination with other internal development teams.</p><p>Conceptualizing original websites and applications design ideas that bring simplicity and user friendliness to complex roadblocks.</p><p>Code, analyze, and provide functional testing for web solutions.</p><p>Maintain project, drafts, files, codes, and scripts in an organized manner.</p><p>Ensure the best possible performance, quality, and responsiveness of solutions.</p><p>Handle Software Support and Updates, patches, and bug fix</p><p>Unit-testing code for robustness, usability, and general reliability.</p><p>Implement Web user interface based on screen designs, wireframes, flowcharts, and other documentation.</p><p>Experience working in an Agile/Scrum development process</p><p>Solid knowledge and experience with Joomla and WordPress website designing.</p><p>Have experience with SEO modifying and technical development.</p><p>Develop and create native websites from scratch using coding languages.</p><p>Design and develop high quality solutions using Core PHP and Laravel or any PHP framework.</p><p>Highly experienced with WordPress CMS web designing and developing, as well as issues and bugs fixing.</p><p>Lead front-end / back-end development teams in architecture of static assets.</p><p>Extract applicable screen design components from wireframes and drafts.</p><p>Ensure developments are in compliance with specifications and design.</p><p>Contribute to all phases of the development lifecycle.</p><p>Fully responsible for solution design and delivery.</p><p>Collaborate with client team to analyze, design, and package new features.</p><p>Provide software solution proposals to decide the best way to implement software.</p><p>Ensuring Client Deliverable and objectives are met with by the team.</p><p><br></p><p><br></p><p>Job Requirements</p><p>Minimum 5 years of experience as a web developer.</p><p>Understanding of visual elements layout, type, and fonts.</p><p>Teamwork skills.</p><p>Professionalism regarding time, costs, and tasks.</p><p>Creativity skills and problem-solving aptitude.</p><p>Proven work experience as a web designer</p><p>Very good spoken and written English.</p>",
    "level": "other",
    "application": "https://eg.linkedin.com/jobs/view/senior-web-developer-at-confidential-3764110938",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Software Development Specialist, Skyvera (Remote) - $30,000/year USD",
    "company": "Crossover",
    "location": "Egypt",
    "description": "Crossover is the world's #1 source of full-time remote jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Skyvera. Have you got what it takes?<br><br>Are you a tech-savvy engineer with a knack for managing complex IT environments? If so, Skyvera has an exciting opportunity for you!<br><br>At Skyvera, we are pioneering the future of telecommunications software solutions, and we're on a mission to lead the industry into the era of public cloud technology. To achieve this vision, we are assembling a team of experts who possess a deep understanding of our technical landscape and a relentless drive to learn and adapt.<br><br>As a key member of our team, you will be responsible for customizing and implementing solutions for a major telecom client and fine-tuning software performance. Your contributions will be instrumental in exploring innovative system configurations and fostering a culture of continuous improvement.<br><br>This is a unique opportunity for individuals who enjoy solving complex problems and aspire to make a meaningful impact on the telecommunications landscape. Join us, and let's shape the future of the industry together!<br><br><strong>What You Will Be Doing<br><br></strong><ul><li>Customize and implement products for a major telecommunications client</li><li>Measure and analyze software performance<br><br></li></ul><strong>What You Won’t Be Doing<br><br></strong><ul><li>Spending endless hours on repetitive and non-impactful tasks</li><li>Operating in isolation without collaborative support<br><br></li></ul><strong>Software Development Specialist Key Responsibilities<br><br></strong><ul><li>Ensuring consistent system operations and software applications are running at peak performance<br><br></li></ul><strong>Basic Requirements<br><br></strong><ul><li>At least 2 years of experience supporting large scale IT environments in the telecommunications industry</li><li>Excellent Linux skills<br><br></li></ul><strong>About Skyvera<br><br></strong>Skyvera maintains your legacy, on-premise software, while reimagining its cloud-native future.<br><br>There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!<br><br><strong>Working with Crossover<br><br></strong>This is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover. The compensation level for this role is $15 USD/hour, which equates to $30,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.<br><br><strong>What to expect next:<br><br></strong><ul><li>You will receive an email with a link to start your self-paced, online job application.</li><li>Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments.<br><br></li></ul><strong>Important!</strong> If you do not receive an email from us:<br><br><ul><li>First, emails may take up to 15 minutes to send, refresh and check again.</li><li>Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.</li><li>Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.</li><li>If all else fails, just reset your password by visiting https://www.crossover.com/auth/password-recovery if you already applied using LinkedIn EasyApply.<br><br></li></ul>Crossover Job Code: LJ-5156-EG-Cairo-SoftwareDevelo1.002<br><br>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/software-development-specialist-skyvera-remote-%2430-000-year-usd-at-crossover-3764106901",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Site Reliability Engineer- II",
    "company": "Careem",
    "location": "Egypt",
    "description": "Careem is building the Everything App for the greater Middle East, making it easier than ever to move around, order food and groceries, manage payments, and more. Careem is led by a powerful purpose to simplify and improve the lives of people and build an awesome organisation that inspires. Since 2012, Careem has created earnings for over 2.5 million Captains, simplified the lives of over 50 million customers, and built a platform for the region’s best talent to thrive and for entrepreneurs to scale their businesses. Careem operates in over 70 cities across 10 countries, from Morocco to Pakistan.<br><br><strong>About The Team<br><br></strong>Part of CareemNextGen Team, the mission of the program is to help grow our new joint Engineering team by learning how to write clean code, use SOLID principle techniques, and design reliable systems. The ultimate goal is to train the new Engineers to build Engineering excellence foundations with high standards. Our programme covers all the areas of Careem tech be it Cyber Security, Data, Infrastructure, and all the Software Engineering tracks like Backend, Frontend as well as Mobile. You will work alongside our top talent for an accelerated learning path. You will have access to some of the most exciting projects and advanced tech for accelerated learning and exposure.<br><br>We are looking for someone passionate about automation, tooling, and frameworks to join the CareemNextGen team. You will be part of the team that has the mandate to enable engineers across all functional divisions at Careem to move as fast as possible, while maintaining our high quality and correctness expectations. Infrastructure Engineering Team work ranges from maintaining our CICD fleet, to optimizing our build and release workflows, and more Site Reliability Engineering flavored work providing monitoring and visibility.<br><br>You will be responsible for maintaining some of our services that power the Careem Engine, scaling highly distributed systems, and continuously documenting and improving our engineering practices. These large-scale, distributed systems handle everything from user requests to payment processing.<br><br><strong>Key Responsibilities Include<br><br></strong><ul><li> Maintain features and systems, with an emphasis on code quality, maintainability, readability, and testing </li><li> Support the rest of the Infrastructure team in adoption by engineers in such a way that makes on-boarding pleasant and seamless. </li><li> Design, write and review application code. </li><li> Opportunity to extend our existing solutions. This will include modifying or developing code Java, Python, GO and different frameworks </li><li> Facilitate collaboration with other engineers, product owners, and designers to solve interesting and challenging problems across our platform </li><li> Be a valued member of an autonomous, cross-functional agile team </li><li> You care about quality and you know what it means to ship high-quality code. <br><br></li></ul><strong>Qualifications<br><br></strong><ul><li> Bachelor's degree in Computer Science, Engineering or related field, or equivalent training, fellowship, or work experience. </li><li> 2 - 4 years experience in building and owning tools for medium to large engineering teams. </li><li> Expert Knowledge in Developing and debugging in one these Java, Go, Python,Bash. </li><li> Experience with terraform and Cloud Formation. </li><li> Experience with other programming languages is a plus. </li><li> Experience of building systems, dashboards and metrics to facilitate a data-driven approach to problem resolution </li><li> Experience with AWS and/or other cloud providers is a plus. </li><li> Unquenchable thirst for learning new things. </li><li> Obsession about keeping costs low while building solutions. </li><li> Experience of Kubernetes is a plus. <br><br></li></ul><strong>What We’ll Provide You<br><br></strong>We offer colleagues the opportunity to drive impact in the region while they learn and grow. As a Careem colleague you will be able to:<br><br><ul><li> Work and learn from great minds by joining a community of inspiring colleagues. </li><li> Put your passion to work in a purposeful organisation dedicated to creating impact in a region with a lot of untapped potential. </li><li> Explore new opportunities to learn and grow every day. </li><li> Enjoy the flexibility that comes with the trust of being an owner; work in a hybrid style with a mix of days at the office and at home, and remotely from any country in the world for 30 days a year with unlimited vacation days per year. </li><li> Access to healthcare benefits and fitness reimbursements for health activities including: gym, health club and training classes.</li></ul>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/site-reliability-engineer-ii-at-careem-3748418307",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Java Developer in Trading",
    "company": "M2",
    "location": "🇦🇪 United Arab Emirates",
    "description": "<ul><li>Please, note this is a position based in Dubai, UAE. Apply ONLY if relocation is feasible for you!<br><br></li></ul>The opportunity: <br><br>Our trading team is looking for a talented <strong>Java Engineer </strong>who would work on improving our <strong>trading syetem</strong> including matching engine, API and WebSocket server. It’s an interesting and challenging position for a high load, <strong>high volume &amp; low latency system.<br><br></strong><strong>Responsibilities:<br><br></strong><ul><li>Design &amp; build new features into crypto trading system</li><li>Develop and optimize trading algorithms, order routing, and execution strategies</li><li>Implement and integrate various cryptocurrency exchange APIs and market data feeds into the trading system</li><li>Extensive use of unit &amp; integration tests</li><li>Use best software practices to ensure code quality</li><li>Improve system performance and decrease overall latency</li><li>Collaborate with infrastructure teams to ensure system stability, scalability, and reliability<br><br></li></ul><strong>Qualifications:<br><br></strong><ul><li>Solid java coding experience with focus on crypto trading systems</li><li>Good understanding of crypto markets, spot trading, order types, and trading protocols.</li><li>Understanding of design patterns &amp; SOLID principles</li><li>Experience of TDD with Junit, Cucumber</li><li>Good knowledge of data structures &amp; algos</li><li>Good knowledge of Spring Boot, Postgres/MySQL</li><li>Good knowledge of API design and development</li><li>Familiarity with DevOps and CI/CD practices</li><li>Sound understanding of message broker technology including Kafka</li><li>Understanding principles behind low latency &amp; zero GC code</li><li>Experience with low latency libraries including Aeron or Chronicle queue/map</li><li>Basic understanding of FIX protocol<br><br></li></ul>At M2 diversity is our strength and we are committed to creating an inclusive environment for all. This means each one of us comes to work knowing that we have a voice and a safe, judgment-free zone to speak freely and express and share our ideas and we will be heard.<br><br>We pride ourselves on embracing our differences and welcome and encourage everyone to apply, regardless of gender, background, age, and abilities.",
    "level": "mid-level",
    "application": "https://ae.linkedin.com/jobs/view/java-developer-in-trading-at-m2-3765573064",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Kernel Resilience Engineer - Canonical Ubuntu",
    "company": "Canonical",
    "location": "🇦🇪 United Arab Emirates",
    "description": "Canonical is building a Kernel Resilience team to harden the Ubuntu kernel. This team will drive proactive efforts to exercise and stretch the stability, reliability, and security of the kernel. Kernel Resilience takes responsibility for the overall quality of the Linux kernel, through aggressive test frameworks and regimens, hardening the kernel against exploits and vulnerabilities, as well as building and maintaining a highly automated kernel build and test infrastructure. We have access to a very large array of hardware, and we would like to keep it busy!<br><br>This is not a role for button pushers to monitor results! We will select candidates who make it their mission to crash or penetrate the kernel, and then drive the eventual resolution of discovered issues. You will be expected to raise the bar on industry best practices, to push the limits of possibility on proactive, gloves-off stress testing.<br><br>The successful candidate will have experience covering some combination of Linux kernel development, quality assurance, security exploits, and back-end development. You may be a seasoned kernel developer looking for a new challenge in back-end automation. You may always have wanted to 'go deeper' into the kernel? Curiosity and a desire to 'poke it and see what happens' will be essential for this role.<br><br>What your day will look like<br><br><ul><li>Work with bleeding edge and early access systems and hardware</li><li>Ensure an ongoing commitment to industry-leading quality, reliability and security standards</li><li>Proactively identify security and stability issues by devising ingenious new ways to break the Linux kernel</li><li>Contribute to the development of an advanced Linux kernel build service</li><li>Engage with other teams at Canonical, the open source community and commercial partners</li><li>Work from home with global travel up to 20% for internal and external events<br><br></li></ul>What we are looking for in you<br><br><ul><li>Innovative out-of-the-box style thinker not afraid to break things</li><li>Significant programming experience in Python, with strong C skills highly regarded</li><li>Ability to communicate effectively in English, both written and oral</li><li>Someone with high standards for overall quality, and not afraid to ensure they are met</li><li>At ease working in several different technical domains concurrently</li><li>Substantial experience in Linux system configuration, customization, and deployment</li><li>Solid understanding Linux kernel internals and development principles</li><li>Deep knowledge of security as it relates to the Linux kernel</li><li>Productive in a globally distributed team through self-discipline and self-motivation, delivering on time</li><li>Contributed to an open source project in the past</li><li>Understanding of agile software development methodologies</li><li>Knowledge of functional safety and/or automotive and industrial standards would be highly regarded<br><br></li></ul>What we offer you<br><br>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.<br><br>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.<br><br><ul><li>Fully remote working environment - we've been working remotely since 2004!</li><li>Personal learning and development budget of 2,000USD per annum</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Parental Leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues at 'sprints'</li><li>Priority Pass for travel and travel upgrades for long haul company events<br><br></li></ul><strong>About Canonical<br><br></strong>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.<br><br>Canonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.<br><br>Canonical is an equal opportunity employer<br><br>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br><br>",
    "level": "junior",
    "application": "https://ae.linkedin.com/jobs/view/kernel-resilience-engineer-canonical-ubuntu-at-canonical-3763980445",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Java Developer",
    "company": "TRIDAT Technologies",
    "location": "🇦🇪 United Arab Emirates",
    "description": "<p>Hello,</p> <p>&nbsp;</p> <p>Greetings for the day !!!</p> <p>&nbsp;</p> <p>Tridat Technologies is hiring \"Senior Java Developer\" for one of the IT based organization focused into payment industry based @ Dubai !!!</p> <p>&nbsp;</p> <p><strong>Experience&nbsp;</strong>-: 6+ Years</p> <p>&nbsp;</p> <p><strong>JOB BRIEF</strong></p> <ul><li>We are looking for a Senior Java Developer to manage the software development life cycle, from planning and prioritizing to testing and release.</li><li>Senior Java Developer responsibilities include gathering system and user requirements, building Java modules and testing features before release.</li><li>If you have hands-on experience developing software with agile methodologies and are ready to lead our junior developers, we'd like to meet you.</li><li>Ultimately, you will deploy and maintain functional, secure and high-quality applications.</li><br></ul> <p>&nbsp;</p> <p><strong>RESPONSIBILITIES:</strong></p> <ul><li>Identify and analyze user requirements</li><li>Prioritize, assign and execute tasks throughout the software development life cycle</li><li>Develop Java EE applications</li><li>Write well-designed, efficient code</li><li>Review, test and debug team members' code</li><li>Design database architecture</li><li>Schedule product releases with internal teams</li><li>Document development phases</li><li>Ensure our applications are secure and up-to-date</li><br></ul> <p>&nbsp;</p> <p><strong>REQUIREMENTS AND SKILLS:</strong></p> <ul><li>Work experience as a Senior Java Developer or similar role</li><li>Experience designing, building and testing Java EE applications</li><li>In-depth knowledge of popular Java frameworks like Spring, Hibernate</li><li>Hands on with Spring boot</li><li>Experience with Object-Oriented Design (OOD)</li><li>Good delegation and time management skills</li><li>Problem-solving abilities</li><li>BSc in Computer Science, Engineering or relevant field</li><br></ul> <p>&nbsp;</p> <p><strong>EDUCATION:&nbsp;</strong>Graduate/Post Graduate preferably in Computer Science/IT</p> <p>&nbsp;</p> <p><strong>WORK MODE:</strong>&nbsp;Work from office</p> <p>&nbsp;</p> <p><strong>EMPLOYMENT MODE:</strong>&nbsp;Permanent – Full time</p> <p>&nbsp;</p> <p>&nbsp;</p> <p>Thank You &amp; Regards,</p> <p><strong>Shraddha Kamble</strong></p> <p><strong>HR Recruiter</strong></p>",
    "level": "junior",
    "application": "https://ae.linkedin.com/jobs/view/java-developer-at-tridat-technologies-3765583410",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Kernel Resilience Engineer - Canonical Ubuntu",
    "company": "Canonical",
    "location": "🇸🇦 Saudi Arabia",
    "description": "Canonical is building a Kernel Resilience team to harden the Ubuntu kernel. This team will drive proactive efforts to exercise and stretch the stability, reliability, and security of the kernel. Kernel Resilience takes responsibility for the overall quality of the Linux kernel, through aggressive test frameworks and regimens, hardening the kernel against exploits and vulnerabilities, as well as building and maintaining a highly automated kernel build and test infrastructure. We have access to a very large array of hardware, and we would like to keep it busy!<br><br>This is not a role for button pushers to monitor results! We will select candidates who make it their mission to crash or penetrate the kernel, and then drive the eventual resolution of discovered issues. You will be expected to raise the bar on industry best practices, to push the limits of possibility on proactive, gloves-off stress testing.<br><br>The successful candidate will have experience covering some combination of Linux kernel development, quality assurance, security exploits, and back-end development. You may be a seasoned kernel developer looking for a new challenge in back-end automation. You may always have wanted to 'go deeper' into the kernel? Curiosity and a desire to 'poke it and see what happens' will be essential for this role.<br><br>What your day will look like<br><br><ul><li>Work with bleeding edge and early access systems and hardware</li><li>Ensure an ongoing commitment to industry-leading quality, reliability and security standards</li><li>Proactively identify security and stability issues by devising ingenious new ways to break the Linux kernel</li><li>Contribute to the development of an advanced Linux kernel build service</li><li>Engage with other teams at Canonical, the open source community and commercial partners</li><li>Work from home with global travel up to 20% for internal and external events<br><br></li></ul>What we are looking for in you<br><br><ul><li>Innovative out-of-the-box style thinker not afraid to break things</li><li>Significant programming experience in Python, with strong C skills highly regarded</li><li>Ability to communicate effectively in English, both written and oral</li><li>Someone with high standards for overall quality, and not afraid to ensure they are met</li><li>At ease working in several different technical domains concurrently</li><li>Substantial experience in Linux system configuration, customization, and deployment</li><li>Solid understanding Linux kernel internals and development principles</li><li>Deep knowledge of security as it relates to the Linux kernel</li><li>Productive in a globally distributed team through self-discipline and self-motivation, delivering on time</li><li>Contributed to an open source project in the past</li><li>Understanding of agile software development methodologies</li><li>Knowledge of functional safety and/or automotive and industrial standards would be highly regarded<br><br></li></ul>What we offer you<br><br>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.<br><br>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.<br><br><ul><li>Fully remote working environment - we've been working remotely since 2004!</li><li>Personal learning and development budget of 2,000USD per annum</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Parental Leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues at 'sprints'</li><li>Priority Pass for travel and travel upgrades for long haul company events<br><br></li></ul><strong>About Canonical<br><br></strong>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.<br><br>Canonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.<br><br>Canonical is an equal opportunity employer<br><br>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br><br>",
    "level": "junior",
    "application": "https://sa.linkedin.com/jobs/view/kernel-resilience-engineer-canonical-ubuntu-at-canonical-3763979600",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Kernel Resilience Engineer - Canonical Ubuntu",
    "company": "Canonical",
    "location": "🇸🇦 Saudi Arabia",
    "description": "Canonical is building a Kernel Resilience team to harden the Ubuntu kernel. This team will drive proactive efforts to exercise and stretch the stability, reliability, and security of the kernel. Kernel Resilience takes responsibility for the overall quality of the Linux kernel, through aggressive test frameworks and regimens, hardening the kernel against exploits and vulnerabilities, as well as building and maintaining a highly automated kernel build and test infrastructure. We have access to a very large array of hardware, and we would like to keep it busy!<br><br>This is not a role for button pushers to monitor results! We will select candidates who make it their mission to crash or penetrate the kernel, and then drive the eventual resolution of discovered issues. You will be expected to raise the bar on industry best practices, to push the limits of possibility on proactive, gloves-off stress testing.<br><br>The successful candidate will have experience covering some combination of Linux kernel development, quality assurance, security exploits, and back-end development. You may be a seasoned kernel developer looking for a new challenge in back-end automation. You may always have wanted to 'go deeper' into the kernel? Curiosity and a desire to 'poke it and see what happens' will be essential for this role.<br><br>What your day will look like<br><br><ul><li>Work with bleeding edge and early access systems and hardware</li><li>Ensure an ongoing commitment to industry-leading quality, reliability and security standards</li><li>Proactively identify security and stability issues by devising ingenious new ways to break the Linux kernel</li><li>Contribute to the development of an advanced Linux kernel build service</li><li>Engage with other teams at Canonical, the open source community and commercial partners</li><li>Work from home with global travel up to 20% for internal and external events<br><br></li></ul>What we are looking for in you<br><br><ul><li>Innovative out-of-the-box style thinker not afraid to break things</li><li>Significant programming experience in Python, with strong C skills highly regarded</li><li>Ability to communicate effectively in English, both written and oral</li><li>Someone with high standards for overall quality, and not afraid to ensure they are met</li><li>At ease working in several different technical domains concurrently</li><li>Substantial experience in Linux system configuration, customization, and deployment</li><li>Solid understanding Linux kernel internals and development principles</li><li>Deep knowledge of security as it relates to the Linux kernel</li><li>Productive in a globally distributed team through self-discipline and self-motivation, delivering on time</li><li>Contributed to an open source project in the past</li><li>Understanding of agile software development methodologies</li><li>Knowledge of functional safety and/or automotive and industrial standards would be highly regarded<br><br></li></ul>What we offer you<br><br>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.<br><br>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.<br><br><ul><li>Fully remote working environment - we've been working remotely since 2004!</li><li>Personal learning and development budget of 2,000USD per annum</li><li>Annual compensation review</li><li>Recognition rewards</li><li>Annual holiday leave</li><li>Parental Leave</li><li>Employee Assistance Programme</li><li>Opportunity to travel to new locations to meet colleagues at 'sprints'</li><li>Priority Pass for travel and travel upgrades for long haul company events<br><br></li></ul><strong>About Canonical<br><br></strong>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.<br><br>Canonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.<br><br>Canonical is an equal opportunity employer<br><br>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.<br><br>",
    "level": "junior",
    "application": "https://sa.linkedin.com/jobs/view/kernel-resilience-engineer-canonical-ubuntu-at-canonical-3763978675",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Data Engineer",
    "company": "DXC Technology",
    "location": "🇪🇬 Egypt",
    "description": "<strong>Job Description<br><br></strong>We are currently seeking a highly skilled and experienced Senior Data Engineer to join our team. As a Senior Data Engineer, you will play a critical role in ensuring the end-to-end visibility of our analytical models according to the design. You will be responsible for implementing the data model that accommodates the customer's event model and aligns with the Elastic Common Schema (ECS). You will also be responsible for mapping attributes in existing monitoring tools, such as Solarwinds and Vynamic, to ECS and creating custom attributes as needed. Furthermore, you will be responsible for the design and implementation of ELK indexes.<br><br><strong>Responsibilities<br><br></strong><ul><li> Ensure the end-to-end visibility of analytical models as per design specifications</li><li> Implement the data model to accommodate the bank event model and align with the Elastic Common Schema (ECS)</li><li> Add any additional event attributes that are not represented in the ECS schema, as applicable</li><li> Implement the mapping of attributes in existing monitoring tools (e.g., Solarwinds and Vynamic) to ECS, including the creation of custom attributes when necessary</li><li> Design and implement ELK indexes to support data analysis and visualization</li><li> Lead the team in implementing the assigned data model</li><li> Collaborate closely with the project manager to ensure data structure, indexes, and mapping tasks are aligned with project timelines<br><br></li></ul><strong>Requirements<br><br></strong><ul><li> In-depth knowledge of the ELK (Elasticsearch, Logstash, and Kibana) platform</li><li> Strong understanding of monitoring and observability concepts</li><li> Experience with the Elastic Common Schema (ECS) and its implementation</li><li> Proficiency in working with JSON data structure and attributes</li><li> Familiarity with monitoring event modeling and attribute customization</li><li> Prior experience with payment and banking systems</li><li> Extensive experience in implementing the Elastic platform</li><li> Proven track record in team leadership and collaboration</li><li> Knowledge of ITSM tools such as ServiceNow is a plus</li></ul>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/data-engineer-at-dxc-technology-3766128216",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Data Engineer",
    "company": "DXC Technology",
    "location": "🇪🇬 Egypt",
    "description": "<strong>Job Description<br><br></strong>We are currently seeking a highly skilled and experienced Senior Data Engineer to join our team. As a Senior Data Engineer, you will play a critical role in ensuring the end-to-end visibility of our analytical models according to the design. You will be responsible for implementing the data model that accommodates the customer's event model and aligns with the Elastic Common Schema (ECS). You will also be responsible for mapping attributes in existing monitoring tools, such as Solarwinds and Vynamic, to ECS and creating custom attributes as needed. Furthermore, you will be responsible for the design and implementation of ELK indexes.<br><br><strong>Responsibilities<br><br></strong><ul><li> Ensure the end-to-end visibility of analytical models as per design specifications</li><li> Implement the data model to accommodate the bank event model and align with the Elastic Common Schema (ECS)</li><li> Add any additional event attributes that are not represented in the ECS schema, as applicable</li><li> Implement the mapping of attributes in existing monitoring tools (e.g., Solarwinds and Vynamic) to ECS, including the creation of custom attributes when necessary</li><li> Design and implement ELK indexes to support data analysis and visualization</li><li> Lead the team in implementing the assigned data model</li><li> Collaborate closely with the project manager to ensure data structure, indexes, and mapping tasks are aligned with project timelines<br><br></li></ul><strong>Requirements<br><br></strong><ul><li> In-depth knowledge of the ELK (Elasticsearch, Logstash, and Kibana) platform</li><li> Strong understanding of monitoring and observability concepts</li><li> Experience with the Elastic Common Schema (ECS) and its implementation</li><li> Proficiency in working with JSON data structure and attributes</li><li> Familiarity with monitoring event modeling and attribute customization</li><li> Prior experience with payment and banking systems</li><li> Extensive experience in implementing the Elastic platform</li><li> Proven track record in team leadership and collaboration</li><li> Knowledge of ITSM tools such as ServiceNow is a plus</li></ul>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/data-engineer-at-dxc-technology-3766124718",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Database Programmer",
    "company": "Worley",
    "location": "🇰🇼 Kuwait",
    "description": "<em><strong>51,000 people. 49 countries. Over 120 office locations.<br><br></strong></em><em>We’re not just engineers. We’re a global team of data scientists, consultants, construction workers and innovators all working to create a better tomorrow. Every day, we help customers in energy, chemicals and resources get one step closer to solving our planet’s toughest issues. Climate change. The energy transition. Digital transformation. And how we can deliver a more sustainable world.?<br><br></em><em>Whatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. For more information, visit Worley.com<br><br></em>Primary Objective<br><br><ul><li> Developing SQL database / Microsoft Access developer includes Packages/Procedures/Functions that include collections, ref-cursors to pass the data between Java applications.</li><li> Reports and the database.</li><li> Develop an information management system that works for each client.</li><li> Gather and analyze requirements from business users and create functional specifications and design documents.</li><li> Create and maintain data loads and business rules.</li><li> Include testing and troubleshooting the program and installing security features to the network.</li><li> Programmer Analyst (QE/A Tester).</li><li> Pre-Analysis and post analysis of the business requirements basis on the client information about the Application.</li><li> Creation of Estimating test effort and Complexity Documents and involved in the walk-through meetings.</li><li> Preparation of the Test Scenarios/Conditions and Test scripts based on the requirements and specification documents provided by the client.</li><li> Performing Functional, Functional Integration and Regression Testing.</li><li> Knowledge in MSSQL and other .net technology is an added advantage.</li><li> Excellent Troubleshooting and Communication Skills.</li><li> Should be able to perform Multitasking &amp; Problem-solving approach.</li><li> Excellent verbal Communication +written.</li><li> Fine Tune SQL queries for better application and system performance.</li><li> Maintain existing programs using Python, Java, HTML/CSS and JSP a plus.</li><li> Monitoring and support of the database Servers.</li><li> MS Windows Management.</li><li> Should be able to perform Multitasking &amp; Problem solving approach.</li><li> Excellent verbal Communication +written.</li><li> Always be dedication to team-members.<br><br></li></ul><strong>Qualification(s) Requirement<br><br></strong><ul><li> Degree in Computer Science, Engineering, or relevant degree.</li><li> Proven years of experience as an SQL Developer or similar database developer role.</li><li> Excellent understanding of T- SQL programming and Microsoft SQL Server.</li><li> Knowledge of Python, HTML and JavaScript.</li><li> Experience with SQL Server Reporting Services, SQL Server Analysis Services, and Transparent Data Encryption (TDE).</li><li> Familiarity with the practical application of NoSQL\\NewSQL databases.</li><li> Strong SQL programming skills in Oracle SQL Server. Knowledge of DB2/UDB2 a plus.</li><li> Shell Scripting skills.</li><li> Ability to understand and adhere to Information security requirements of the organizations and the specific responsibility assigned.<br><br></li></ul><strong>What We Offer You<br><br></strong><em>Providing an agile culture and challenging work opportunities results in a positive work environment. Our people enjoy competitive compensation packages and a fun, personal, collaborative and safe working environment. We value equal employment opportunity and are committed to promoting fairness, equality and diversity.<br><br></em><em>Our policy is to conduct background checks for all candidates who accept an offer of employment with us.<br><br></em><strong><em>If you have the passion and talent to keep up, it's time to test the limits of what you can become. Find your future with Worley.<br><br></em></strong><strong>Company<br><br></strong>Worley<br><br><strong>Primary Location<br><br></strong>KWT-AMD-Ahmadi<br><br><strong>Job<br><br></strong>Applications<br><br><strong>Schedule<br><br></strong>Full-time<br><br><strong>Employment Type<br><br></strong>Employee<br><br><strong>Job Level<br><br></strong>Experienced<br><br><strong>Job Posting<br><br></strong>Nov 15, 2023<br><br><strong>Unposting Date<br><br></strong>Ongoing<br><br><strong>Reporting Manager Title<br><br></strong>Operations Director",
    "level": "other",
    "application": "https://kw.linkedin.com/jobs/view/database-programmer-at-worley-3765825059",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Senior Integration Engineer",
    "company": "Rasan",
    "location": "🇪🇬 Egypt",
    "description": "<ul><li><span></span><strong>Company Description:</strong></li></ul><p><span>Rasan is a FinTech company founded in Riyadh, Saudi Arabia in 2015, with a specialization in the Insurance and Banking Technology sectors in the Gulf Region. The company is dedicated to creating innovative insurance and banking solutions to improve individuals and businesses' financial transactions and asset protection. They have successfully introduced pioneering digital solutions in the market, such as \"Tameeni\" and \"Awal Mazad.\"</span></p><p><br></p><p><strong>Responsibilities</strong></p><ul><li><span>Design integration solutions and develop integration guides: Create detailed integration guides that include web services detailing, overall design documents, and technical specifications to facilitate seamless integration between our systems and those of connected vendors.</span></li><li><span> Collaborate with vendors/customers: Engage in discussions with connected vendors/customers to gather requirements, understand their systems, and ensure smooth integration. Act as a technical liaison between our organization and the vendors/customers.</span></li><li><span>Communicate technical requirements: Clearly communicate technical requirements to the development team, including system architecture, data formats, protocols, and security considerations. Provide support during the implementation phase to address any integration-related issues.</span></li><li><span> Attend technical discussions: Participate in technical discussions with vendor technical teams to understand their integration capabilities, address technical queries, and ensure alignment between our systems and theirs.</span></li><li><span>Plan, Manage and execute Integration and Boarding Projects: Plan project deliveries and follow up over Project delivery progress and make sure to report any related achievements/challenges.</span></li><li><span> Track and report Integration solution status: Track status of integration solutions and activities and prepare periodic/on demand reports.</span></li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li><span>Bachelor’s OR master’s degree in computer science or equivalent education and experience.</span></li><li><span>4+ years of relevant work experience in the integration development domain.</span></li></ul>",
    "level": "other",
    "application": "https://eg.linkedin.com/jobs/view/senior-integration-engineer-at-rasan-3764157705",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "Senior Data Engineer (Contract)",
    "company": "tlnt",
    "location": "🇶🇦 Qatar",
    "description": "<strong>The Role<br><br></strong><strong>Requirements<br><br></strong>We are seeking a highly experienced Senior Data Engineer with 5+ years of expertise in Azure data engineering. This role is responsible for the development and management of data pipelines, data modeling, and supporting organizational data analytics and insights initiatives. The ideal candidate will be proficient in tools and technologies like Pyspark, Azure Data Factory (ADF), Databricks, big data technologies, SQL, and Python. Additionally, the Senior Data Engineer will play a critical role in stakeholder management, leading development teams or project teams, guiding design discussions, and taking ownership of deliverables for larger projects. Effective communication skills are essential for understanding and translating functional and technical requirements into practical solutions. The ideal person will:<br><br><ul><li>Design, build, and maintain data pipelines in the Azure environment, ensuring smooth operation in both batch and real-time processing. </li><li>Optimize Azure data infrastructure to facilitate accurate data extraction, transformation, and loading from a variety of data sources. </li><li>Develop and automate ETL processes using tools like Pyspark, Azure Data Factory, and Databricks to facilitate data extraction and manipulation from diverse sources. </li><li>Transform raw data stored in Azure Data Warehouses into accessible datasets suitable for both technical and non-technical stakeholders. </li><li>Demonstrate expertise in Azure services and big data technologies, including but not limited to Azure Data Factory, Databricks, and other relevant tools. Proficiency in SQL and Python is also crucial. </li><li>Engage in business discussions, collaborate with stakeholders, and take ownership of deliverables, ensuring that the data engineering solutions align with business objectives. </li><li>Lead development teams or project teams, providing guidance and expertise to ensure the successful execution of data engineering projects. </li><li>Function as an independent developer who can guide design discussions and make informed decisions to drive project success. </li><li>Leverage extensive experience to handle larger projects and manage multiple teams effectively. </li><li>Exhibit excellent communication skills, translating functional and technical requirements into actionable solutions that meet business needs. <br><br></li></ul><strong>The Person<br><br></strong><ul><li>Minimum of 4 years of hands-on experience in Azure data engineering. </li><li>Proficiency in a range of key technologies is essential, including Pyspark, Azure Data Factory (ADF), Databricks, big data tools, SQL, and Python. </li><li>Should be adept at handling business discussions and be capable of taking ownership of deliverables. </li><li>Effective stakeholder management is crucial, including leading development teams or project teams to ensure successful project outcomes. </li><li>Self-sufficient developer who can provide guidance in design discussions and make informed decisions. </li><li>Demonstrated experience in successfully managing larger projects and multiple teams is a key requirement. </li><li>Excellent communication skills are necessary to understand and bridge the gap between functional and technical requirements, providing practical and effective solutions. <br><br></li></ul><strong>Note: </strong>Preferred candidates will be in Doha, Qatar or willing to relocate to Doha<br><br>﻿Our client is an equal opportunity employer, and we celebrate diversity and are committed to creating an inclusive environment for all.<br><br><strong>Note</strong>: This job description is intended to convey information essential to understanding the scope of the position and is not an exhaustive list of skills, efforts, duties, responsibilities, or working conditions associated with it.<br><br>Skills: azure,databricks,azure data factory (adf),big data technologies,pyspark,sql,azure data engineering,azure data factory,python",
    "level": "mid-level",
    "application": "https://qa.linkedin.com/jobs/view/senior-data-engineer-contract-at-tlnt-3760309657",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  },
  {
    "title": "React.js Developer",
    "company": "Adroitco, Inc",
    "location": "🇦🇪 United Arab Emirates",
    "description": "<p>Role Description</p><p>We are looking for a highly skilled React Developer for a full-time on-site role in Dubai. The role involves developing and implementing user interface (UI) components, following well-known React workflows such as Redux. The React Developer will collaborate with the development team to ensure all elements of the web application are consistent. They will be responsible for translating designs and wireframes into high-quality code, and working with the rest of the team to define and maintain UI/UX standards.</p><p><br></p><p>Need 2-3 years of experience in React.</p><p><br></p><p>Qualifications</p><ul><li>Advanced proficiency in ReactJS, JavaScript, HTML, CSS, and front-end development tools</li><li>Experience with popular React.js workflows (such as Redux)</li><li>Strong knowledge of system integration, web services, and API development</li><li>Experience working with Agile methodologies, and strong ability to work on collaborative team projects</li><li>A degree in Computer Science or a related field</li><li>Strong problem-solving skills, attention to detail, and ability to take proactive approach to work</li><li>Excellent verbal and written communication skills in English and strong interpersonal skills</li></ul><p><br></p>",
    "level": "junior",
    "application": "https://ae.linkedin.com/jobs/view/react-js-developer-at-adroitco-inc-3760329641",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "other",
    "tech": "other",
    "revised": true
  }
]