[
  {
    "title": "Back End Developer",
    "company": "360Code",
    "location": "🇪🇬 Egypt",
    "description": "<p><strong>Company Description</strong></p><p>360Code is a specialized company in software and programming solutions, including Web, Mobile development and CRM, ERP and AI solutions. Located in Nasser City, our team is focused on delivering high-quality solutions to our clients to help their businesses achieve success.</p><p><br></p><p><strong>Role Description</strong></p><p>360Code is seeking a full-time PHP Web Developer to join our team on-site in Nasser City. The PHP Web Developer will be responsible for designing, developing, and maintaining web applications using PHP, MySQL, HTML, CSS, and JavaScript. Additionally, the PHP Web Developer will work closely with other members of the team to ensure that projects are completed on time and to the highest quality standards.</p><p><br></p><p><strong>Qualifications</strong></p><ul><li>Strong experience in PHP, MySQL, HTML, CSS, and JavaScript</li><li>2-4 years of experience with PHP frameworks such as Laravel</li><li>Experience with web development tools such as Git and Docker</li><li>Ability to design and maintain relational databases and optimize for performance</li><li>Understanding of web security practices</li><li>Understanding of Agile development methodologies</li><li>Excellent problem-solving skills and attention to detail</li><li>Bachelor's degree in Computer Science or a related field</li><li>Basic knowledge of front-end web development frameworks such as ReactJS</li><li>Basic knowledge of cloud services such as AWS.</li></ul>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/back-end-developer-at-360code-3761814409",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "php",
    "revised": true
  },
  {
    "title": "Senior Backend Software Engineer",
    "company": "Robusta Studio",
    "location": "🇪🇬 Egypt",
    "description": "<strong>Who We Are (Company Introduction)<br><br></strong>Robusta Technology Group (RTG) is a key driver of digital transformation by providing a holistic tech ecosystem. RTG works with its local and international partners to help build digital customer experiences, establish remote engineering hubs, and build ventures across multiple industries and domains. In this pursuit, RTG serves as a catalyst for impact and growth through events, spaces, and content focused on creating impact and growth across the different interactions.<br><br>Robusta is a tech agency working with a diverse client base across different sectors &amp; industries on implementing digital transformation programs. Engagements are typically focused on the digitization of existing operations &amp; processes and/or activation of digital customer engagement channels. With a team of 100+ tech and market consultants, robusta maintains an impactful footprint across EMEA and engages with its clients through its two key operations hubs in Egypt and Germany.<br><br><strong>Our Engineering Team<br><br></strong>At Robusta Studio, Engineers are craftsmen, we take pride in our skills and our target is delivering the right value to our partners.<br><br>Our growing team of 60+ Engineers organized across 7 tribes, take pride in their craft, and we are always seeking to build a robust, scalable, resilient, and clean product; we deeply believe one day of good design saves us months of bad implementation.<br><br><strong>Our Backend Tribe<br><br></strong>We understand Backend as daily working with complex distributed systems. We can work calmly under pressure and work calmly without pressure. We enjoy working with a relaxed state of mind and really value inner peace. We love food so much, we eat so much, it would be of great value if you do not do any kind of diet.<br><br>Come join a relaxed but productive food-loving fun tribe!<br><br><strong>Who are we looking for? (About you)<br><br></strong>You have a beautiful mind, and a positive vibe and you are not afraid to get your hands dirty on the keyboard.<br><br>We do not really have a specific requirement regarding languages and frameworks. We are looking for a mechanic with a strong knowledge of the concepts and paradigms. A craftsman who can master any project by juggling more than one language and framework.<br><br><ul><li>You are experienced with Agile methodology </li><li>We are currently looking for Engineers with experience in PHP</li><li>You are familiar with some of these tools: Docker, Kubernetes, Postgres, or Elastic search</li><li>Our engineers juggle between multiple languages like Ruby on Rails, PHP on Laravel &amp; Magento, Python on Django<br><br></li></ul><strong>What are your responsibilities? Your life as a Backend Engineer<br><br></strong>As a Backend Engineer, you will be working on different types of products from websites to enterprise platforms. As part of a cross-functional team focused on delivery, you will be responsible for building the engine that powers the entire product. Here are some examples of how your day will go:<br><br><ul><li>Attending daily stand-ups</li><li>Working on release planning &amp; sprint plan and giving accurate estimates for user stories</li><li>Architecting solutions and writing elegant, testable &amp; scalable code</li><li>Reviewing and giving feedback to your peers about their code </li><li>Staying ahead of the game and up to date with the latest the field has to offer </li><li>Contributing to our Engineering blog and giving technical sessions to your peer<br><br></li></ul><strong>Requirements<br><br></strong><strong>What we need from you<br><br></strong><ul><li>Bachelor's degree in Computer Science or a related field</li><li>Minimum of 5 years of professional experience in backend software development</li><li>Strong proficiency in programming languages especially PHP</li><li>Extensive experience with web application frameworks (e.g., Laravel, Spring, Django, Ruby on Rails)</li><li>In-depth knowledge of database design and optimization</li><li>Experience with version control systems (e.g., Git) and agile development methodologies</li><li>Familiarity with cloud platforms, such as AWS, GCP or Azure</li><li>Excellent problem-solving and analytical skills</li><li>Strong communication and collaboration abilities</li><li>Ability to work in a fast-paced and dynamic environment<br><br></li></ul><strong>Benefits<br><br></strong><strong>Why work with us?<br><br></strong><ul><li>Embrace a brighter future with comprehensive Social/Medical Insurance</li><li>Collaborate with industry-leading tech talents</li><li>Nurture your career in a dynamic growth culture</li><li>Enjoy financial benefits with a cost of living allowance (COLA)</li><li>Secure your financial future with our savings plan</li><li>Experience the freedom of our remote-first work model</li><li>Customize your work-life balance with flexible working hours <br><br></li></ul>Join us to shape your career and thrive in a supportive, forward-thinking environment",
    "level": "senior",
    "application": "https://eg.linkedin.com/jobs/view/senior-backend-software-engineer-at-robusta-studio-3766406884",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "python",
    "revised": true
  },
  {
    "title": "Java Developer",
    "company": "SAQAYA",
    "location": "🇪🇬 Egypt",
    "description": "<ul><li>Job Title: Freelance Java Developer (Remote)</li><li>Location: Egypt</li><li>Company: SAQAYA</li></ul><p><br></p><p><strong><em><u>Please be aware that this position is within the gambling industry. If your religious beliefs are impacted by this, we kindly request that you refrain from applying. We deeply respect diverse perspectives and have no intention of causing offense</u></em></strong></p><p><br></p><p>About Us:</p><p><br></p><p>SAQAYA is a rapidly growing technology company specializing in delivering cutting-edge technology solutions for UK companies. We are currently seeking experienced Java developers to join our team on a freelance basis. If you are a skilled Java developer with 8 years or more of experience and are interested in working remotely with international clients, we want to hear from you.</p><p><br></p><p>Job Description:</p><p><br></p><p>As a freelance Java developer at SAQAYA, you will have the opportunity to work on challenging and rewarding projects for us. Your responsibilities will include:</p><p><br></p><ul><li>Developing high-quality software solutions using Java.</li><li>Collaborating with cross-functional teams to understand client requirements and deliver solutions.</li><li>Writing clean, maintainable, and efficient code.</li><li>Participating in code reviews and contributing to code quality.</li><li>Problem-solving and troubleshooting software defects.</li></ul><p>You will need to have good experience in Java, HTML, CSS, JavaScript, and building complex APIs. Experience using Git with GitHub and creating relational databases with PostGres, MySQL, or Oracle on cloud services such as Azure, AWS, GCP is essential. As a passionate, product-minded, and efficient developer, you will be working closely with the team and be responsible for meeting strict deadlines and timescales within a structured agile team.</p><p><br></p><p><br></p><p>To be considered for this role, you should meet the following requirements:</p><p><br></p><ul><li>Minimum of 8 years of professional experience in Java development.</li><li>Proficiency in Java and the Java EE framework.</li><li>Strong understanding of object-oriented design principles.</li><li>Demonstrated ability to work independently and meet project deadlines.</li><li>Effective communication and teamwork skills.</li><li>A proactive approach to learning and keeping up with technology advancements.</li></ul><p><br></p><p>Benefits:</p><p><br></p><p>SAQAYA offers the following benefits to our freelance Java developers:</p><p><br></p><ul><li>Competitive compensation, with daily rates of $157 based on your experience and expertise.</li><li>The flexibility to work remotely from Egypt, providing a healthy work-life balance.</li><li>Exciting and diverse projects, allowing you to expand your skill set.</li><li>Opportunities for professional growth and advancement.</li><li>Supportive and collaborative team members passionate about technology.</li></ul><p><br></p><p>How to Apply:</p><p><br></p><p>If you are a dedicated Java developer with 8 or more years of experience and are interested in working remotely with us, please send your resume to yurena@saqaya.com.</p><p><br></p><p><em><u>Please be aware that this position is within the gambling industry. If your religious beliefs are impacted by this, we kindly request that you refrain from applying. We deeply respect diverse perspectives and have no intention of causing offense</u></em></p>",
    "level": "mid-senior",
    "application": "https://eg.linkedin.com/jobs/view/java-developer-at-saqaya-3766591276",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "java",
    "revised": true
  },
  {
    "title": "Opportunity for Senior Java Spring Developer",
    "company": "Capgemini",
    "location": "🇪🇬 Egypt",
    "description": "<p>Position: Senior Java Spring Developer</p><p>Work Location: Cairo, Egypt</p><p>Experience: 4-10 Years</p><p><br></p><p>o 4+ years of production experience in Java</p><p>o Strong knowledge of Java Core, Collections, Stream API, Concurrency</p><p>o Knowledge of Spring Core, Spring Boot, Spring MVC, Spring Security</p><p>o Knowledge of JWT, OIDC</p><p>o Knowledge of SQL/noSQL, ability to design schemes and write optimal queries</p><p>o Working knowledge of Git</p><p>o Higher education in IT</p><p>o A good understanding of software development principles like Clean Code and SOLID principals.</p><p><br></p><p>Interested please share your CV's to ekta.praful-thakkar@capgemini.com with below details.</p><p><br></p><p>Total Experience :</p><p>Experience in Core Java:</p><p>Experience in Spring :</p><p>Current Salary in EGP (Please specify is it GROSS OR NET):</p><p>Expected Salary in EGP (Please specify is it GROSS OR NET):</p><p>Official Notice Period:</p><p><br></p><p>Thanks &amp; Regards</p><p>Talent Acquisition Team</p>",
    "level": "senior",
    "application": "https://eg.linkedin.com/jobs/view/opportunity-for-senior-java-spring-developer-at-capgemini-3761447813",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "java",
    "revised": true
  },
  {
    "title": "Junior/Standard/Senior Software and Simulation Engineer - Augmented Visibility",
    "company": "Valeo",
    "location": "🇪🇬 Egypt",
    "description": "Valeo ist ein globales Technologieunternehmen, das innovative Lösungen entwickelt, um die Mobilität neu zu erfinden. Wir sind ein Partner von Automobilherstellern und Akteuren der neuen Mobilität weltweit. Unsere Vision? Eine grünere und sicherere Mobilität zu erfinden, dank Lösungen, die sich auf intuitives Fahren und die Reduzierung von CO2-Emissionen konzentrieren. Wir sind führend in unseren Geschäftsbereichen und werden als eines der weltweit größten innovativen Unternehmen anerkannt.<p><br></p><strong>Description</strong><p><br></p><strong>From 0-1 year of experience roles &amp; responsibilities:</strong><p><br></p>As a member of Visibility team in Cairo, you will take part in diverse activities along the entire Software development cycle, among which are:<p><br></p><u>Requirements analysis:</u><p><br></p><ul><li> Analyze customer requirements and identify any conflicting requirements</li><li> Analyze Software safety requirements</li><li> Manage requirements traceability on DOORS</li></ul><p><br></p><u>Design and implementation:</u><p><br></p><ul><li> Develop Software requirements specifications on different levels(System, SRS and CDD)</li><li> Develop Matlab (Simulink and Stateflow)/Statemate models</li><li> Manual coding of Software components using C</li><li> Implement basic Software mechanisms according to ISO 26262</li></ul><p><br></p><u>Testing:</u><p><br></p><ul><li> Run unit testing using Rational Test RealTime</li><li> Run static analysis tools on the software: QAC and Polyspace</li><li> Run Model-In-The-Loop (MIL) and Software-In-The-Loop (SIL) testing on Software models</li><li> Run SW validation on the motors using Vector tools</li><li> Report findings on the configuration management tool</li></ul><p><br></p><strong>From 1-3 years of experience roles &amp; responsibilities:</strong><p><br></p>As a member of Visibility team in Cairo, you will take part in diverse activities along the entire Software development cycle, among which are:<p><br></p><u>Requirements analysis:</u><p><br></p><ul><li> Analyze customer requirements and identify any conflicting requirements</li><li> Analyze Software safety requirements</li><li> Manage requirements traceability on DOORS</li></ul><p><br></p><u>Design and implementation:</u><p><br></p><ul><li> Develop Software requirements specifications on different levels(System, SRS and CDD)</li><li> Develop Matlab (Simulink and Stateflow)/Statemate models</li><li> Manual coding of Software components using C</li><li> Implement basic Software mechanisms according to ISO 26262</li><li> Perform technical reviews on software component design, implementation, and testing</li></ul><p><br></p><u>Testing:</u><p><br></p><ul><li> Run unit testing using Rational Test RealTime</li><li> Run static analysis tools on the software: QAC and Polyspace</li><li> Run Model-In-The-Loop (MIL) and Software-In-The-Loop (SIL) testing on Software models</li><li> Run SW validation on the motors using Vector tools</li><li> Report findings on the configuration management tool</li></ul><p><br></p><strong>From 3-5 years of experience roles &amp; responsibilities:</strong><p><br></p>As a member of Visibility team in Cairo, you will take part in diverse activities along the entire Software development cycle, among which are:<p><br></p><u>Requirements analysis:</u><p><br></p><ul><li> Analyze customer requirements and identify any conflicting requirements</li><li> Analyze Software safety requirements</li><li> Manage requirements traceability on DOORS</li></ul><p><br></p><u>Design and implementation:</u><p><br></p><ul><li> Develop Software requirements specifications on different levels(System, SRS and CDD)</li><li> Develop Matlab (Simulink and Stateflow)/Statemate models</li><li> Manual coding of Software components using C</li><li> Implement basic Software mechanisms according to ISO 26262</li><li> Perform technical reviews on software component design, implementation, and testing</li></ul><p><br></p><u>Testing:</u><p><br></p><ul><li> Run unit testing using Rational Test RealTime</li><li> Run static analysis tools on the software: QAC and Polyspace</li><li> Run Model-In-The-Loop (MIL) and Software-In-The-Loop (SIL) testing on Software models</li><li> Run SW validation on the motors using Vector tools</li><li> Report findings on the configuration management tool</li></ul><p><br></p>Support and improvement:<p><br></p><ul><li> Support and coaching new team members in their daily on-job tasks</li><li> Perform technical &amp; quality reviews.</li><li> Continuously communicate work progress through attendance of daily &amp; weekly project meetings. (Internal and external with other Valeo sites).</li></ul><p><br></p><strong>Qualifications</strong><p><br></p>Degree of Engineering in one the following fields:<p><br></p><ul><li>Computer Science</li><li>Communication</li><li>Electronics</li><li>Mechatronics</li><li>Electrical Engineering</li><li> From 0 to 5 years of relevant experience.</li><li> Knowledge of French or German is a plus.</li><li> Good command of English language is a must.</li><li> Travel to other Valeo Visibility sites (Germany, France, USA, China, or Poland).</li></ul><p><br></p><strong>Job:</strong><p><br></p>R&amp;D Engineer<p><br></p><strong>Organization:</strong><p><br></p>Engineering Software CDA<p><br></p><strong>Schedule:</strong><p><br></p>Vollzeit<p><br></p><strong>Employee Status:</strong><p><br></p>Unbefristet<p><br></p><strong>Job Type:</strong><p><br></p>lokaler Vertrag<p><br></p><strong>Job Posting Date:</strong><p><br></p>2023-08-01<p><br></p><em>Join Us !<br><br>Being part of our team, you will join:<br><br><ul><li> one of the largest global innovative companies, with more than 20,000 engineers working in Research &amp; Development</li><li> a multi-cultural environment that values diversity and international collaboration</li><li> more than 100,000 colleagues in 31 countries... which make a lot of opportunity for career growth</li><li> a business highly committed to limiting the environmental impact if its activities and ranked by Corporate Knights as the number one company in the automotive sector in terms of sustainable development<br><br></li></ul>More information on Valeo: <u>https://www.valeo.com</u></em>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/junior-standard-senior-software-and-simulation-engineer-augmented-visibility-at-valeo-3679884549",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "-",
    "revised": true
  },
  {
    "title": "Senior Java Back End Deve...",
    "company": "RoundPixel",
    "location": "🇪🇬 Egypt",
    "description": "Job description<p>Job description</p><p>Job description</p><p>For immediate hiring Senior Java SpringBoot Microservices Backend Developer for a well-known Telecom Operator in KSA (4 to 8 years of working experience).....</p><p><br></p><p>Job Description:</p><p><br></p><ul><li>Develop design for medium complex features of the applications.</li><li>Write code as per defined architecture and design, following coding standards and best practices.</li><li>Lead in technical discussions, stand-ups, retrospectives, meetings, and demos.</li><li>Follow processes like code version control, task updates in JIRA, CI-CD Dev Ops, and other project-specific processes.</li><li>Perform unit testing of your code before giving it for review/QA.</li><li>Get your code reviewed and approved by the Architect.</li><li>Assist the Architect in defining coding standards, best practices, technical design, and architecture.</li><li>Manage the delivery of multiple modules or small projects.</li><li>Be a team player.</li></ul><p> ..</p><p>Job Requirements:</p><p><br></p><ul><li>Bachelor of Computer Science, S/W programming, IT or MIS</li><li>4+ years of practical experience...</li><li>Java 8+</li><li>Springboot and Spring Cloudd</li><li>Knowledge in Agile, Exposure to JIRA, managing code in Git</li><li>Excellent Communication skill</li><li>Exposure to Microservice, Event-Driven architecture</li><li>Excellent experience in one or more database SQL &amp; NoSQL (PostgreSQL, MySQL, Oracle, SQL Server, MongoDB, DynamoDB)</li><li>ETL Knowledge is preferred and Good Knowledge of Design Pattern</li><li>Proper understanding of SOLID and clean code principles</li><li>Knowledge of Message Queues and Brokers</li><li>Advanced problem-solving skills...</li><li>Strong knowledge of RESTful APIs standards and best practices</li><li>►►&nbsp;Fitting candidates will be contacted and given a short assignment for skills validation./</li></ul><p><br></p>",
    "level": "senior",
    "application": "https://eg.linkedin.com/jobs/view/senior-java-back-end-deve-at-roundpixel-3765026993",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "java",
    "revised": true
  },
  {
    "title": "Integration Developer",
    "company": "DXC Technology",
    "location": "🇪🇬 Egypt",
    "description": "<strong>Job Description<br><br></strong><strong>Role Purpose:<br><br></strong>We are looking for an <strong>Integration Developer</strong> with experience in building high-performing, scalable, enterprise-grade applications.<br><br>You will be part of a talented software team that works on mission-critical applications. Integration Developer roles and responsibilities include managing Java application development while providing expertise in the full software development lifecycle, from concept and design to testing.<br><br><strong>Responsibilities<br><br></strong><ul><li>Contribute to all phases of the development lifecycle</li><li>Write well-designed, testable, efficient code</li><li>Ensure designs are in compliance with specifications</li><li>Prepare and produce releases of software components</li><li>Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review<br><br></li></ul><strong>Skills And Experience<br><br></strong><ul><li>BS/MS degree in Computer Science, Engineering, or a related subject</li><li>Minimum 2 years of experience</li><li>Have previous experience with Bank (Advantage)</li><li>Strong Experience in SQL DB and ELK platform knowledge</li><li>Strong Experience with Elastic Common Schema minimum 1 Year</li><li>Experience with API skills</li><li>Experience with SQL</li><li>Proven hands-on Software Development experience</li><li>Strong communication skills<br><br></li></ul><strong>Please read the JD carefully before applying</strong>",
    "level": "mid-senior",
    "application": "https://eg.linkedin.com/jobs/view/integration-developer-at-dxc-technology-3767024051",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "java",
    "revised": true
  },
  {
    "title": "Senior Java Back End Deve...",
    "company": "Digi Visions Technologies",
    "location": "🇪🇬 Egypt",
    "description": "Job description<p>Job description</p><p>For immediate hiring Senior Java SpringBoot Microservices Backend Developer for a well-known Telecom Operator in KSA (4 to 8 years of working experience).....</p><p><br></p><p>Job Description:</p><p><br></p><ul><li>Develop design for medium complex features of the applications.</li><li>Write code as per defined architecture and design, following coding standards and best practices.</li><li>Lead in technical discussions, stand-ups, retrospectives, meetings, and demos.</li><li>Follow processes like code version control, task updates in JIRA, CI-CD Dev Ops, and other project-specific processes.</li><li>Perform unit testing of your code before giving it for review/QA.</li><li>Get your code reviewed and approved by the Architect.</li><li>Assist the Architect in defining coding standards, best practices, technical design, and architecture.</li><li>Manage the delivery of multiple modules or small projects.</li><li>Be a team player.</li></ul><p> ..</p><p>Job Requirements:</p><p><br></p><ul><li>Bachelor of Computer Science, S/W programming, IT or MIS</li><li>4+ years of practical experience...</li><li>Java 8+</li><li>Springboot and Spring Cloudd</li><li>Knowledge in Agile, Exposure to JIRA, managing code in Git</li><li>Excellent Communication skill</li><li>Exposure to Microservice, Event-Driven architecture</li><li>Excellent experience in one or more database SQL &amp; NoSQL (PostgreSQL, MySQL, Oracle, SQL Server, MongoDB, DynamoDB)</li><li>ETL Knowledge is preferred and Good Knowledge of Design Pattern</li><li>Proper understanding of SOLID and clean code principles</li><li>Knowledge of Message Queues and Brokers</li><li>Advanced problem-solving skills...</li><li>Strong knowledge of RESTful APIs standards and best practices</li><li>►►&nbsp;Fitting candidates will be contacted and given a short assignment for skills validation./</li></ul><p><br></p>",
    "level": "senior",
    "application": "https://eg.linkedin.com/jobs/view/senior-java-back-end-deve-at-digi-visions-technologies-3765024973",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "java",
    "revised": true
  },
  {
    "title": "Service Engineer",
    "company": "Atlas Copco",
    "location": "🇪🇬 Egypt",
    "description": "<strong>Passionate people create exceptional things<br><br></strong>Did you know that the solutions we develop are a key part of most industries? Electronics, medical research, renewable energy, food production, infrastructure and many more.<br>We´re everywhere! Working with us means working with the latest technologies and groundbreaking, sustainable innovations. With our inclusive and caring environment, you get the support and inspiration you need to grow.<br>Here, your ideas are embraced, and you never stop learning. Interested in being part of our team?<br><br><strong>Join us on our journey for a better tomorrow.<br><br></strong><strong>Your Role<br><br></strong>The role of Service Engineer is to provide service for various PT products at workshops and customer sites, ensuring Atlas Copco standards are always upheld.<br>The role will report to the Regional Operations Manager and will be located in Cairo, Egypt.<br>The main responsibilities of the role are:<br><br><ul><li> Effectively diagnose electrical and mechanical faults on customers' equipment.</li><li> Commissioning of all PT-related products.</li><li> Overhauling and repairing of customers equipment.</li><li> Conducting preventative maintenance work.</li><li> Assisting in planning and organizing daily and weekly visit schedules.</li><li> Always Apply engineering “best practice”.</li><li> Maintaining tools and test instruments to ensure they remain in good condition.</li><li> Delivering feedback from the site to the Spare Parts and Service Sales Team.</li><li> Fostering a strong relationship with the local customer base.</li><li> Be aware of, and apply, Health and Safety regulations in the Service Centre and on site.</li><li> Effectively always promote the Atlas Copco company image.</li><li> Use all resources and attend training to develop knowledge and skills.</li><li> Perform additional related duties as required.<br><br><br></li></ul><strong>To succeed, you will need <br><br></strong><strong>Skills<br><br></strong><ul><li>Advanced problem-solving skills.</li><li>Well-organized and able to multi-task.</li><li>Good interpersonal and customer care skills.</li><li>Customer-oriented attitude. </li><li>Well-developed communication skills at all levels of the organization.<br><br><br></li></ul><strong>Essential<br><br></strong><strong>Experience and knowledge requirements<br><br></strong><ul><li>Solid knowledge of engineering principles and procedures.</li><li>Solid knowledge of product functions and parts.<br><br><br></li></ul><strong>Desirable<br><br></strong><ul><li>Hands-on experience with air compressors.</li><li>Hands-on experience with lighting towers, generators, and pumps. </li><li>Knowledge of electrical drawings and circuits.</li><li>Good English language skills, both written and verbal.<br><br><br></li></ul><strong>In return, we offer you<br><br></strong>You will join a successful and motivated team and have the opportunity to develop your knowledge and skills in a rewarding role.<br><br><strong>City<br><br></strong>Cairo<br><br><strong>Recruiter<br><br></strong>[email protected]<br><br><strong>Hiring Manager<br><br></strong>Haytham Mohamed Khamis<br><br><strong>Last Day to Apply<br><br></strong>16 November 2023<br><br><strong>Diverse by nature and inclusive by choice<br><br></strong>Bright ideas come from all of us. The more unique perspectives we embrace, the more innovative we are. Together we build a culture where difference is valued and we share a deep sense of purpose and belonging.",
    "level": "-",
    "application": "https://eg.linkedin.com/jobs/view/service-engineer-at-atlas-copco-3760301168",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "-",
    "revised": true
  },
  {
    "title": "MS Dynamics Developer",
    "company": "The Tech Talents",
    "location": "🇪🇬 Egypt",
    "description": "<p>A leading financing solutions company, partially owned by the Egyptian Central Bank is hiring Microsoft Dynamics Developer:</p><p><br></p><p><strong><u>Responsibilities</u></strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Perform development work in agile setup</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Responsible for support of ERP application, Including:</span></p><p>§&nbsp;<span>Engaged in all ERP (Microsoft Dynamics365) enhancements.</span></p><p>§&nbsp;<span>Develop test plans and participate in code testing to ensure workability, completeness, and quality</span></p><p>§&nbsp;<span>Troubleshoots and fixes bugs and performance issues in Dynamics365 applications</span></p><p>§&nbsp;<span>Creates and modifies related reports</span></p><p>§&nbsp;<span>Able to Identify when to use Existing ERP Functionality that can meet the requirement and when to Customize. </span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Responsible for creating/ Validating technical and functional documentation documenting enhancements or new application requests.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Engaged in all development project initiatives as requested </span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>&nbsp;Responsible for designing and developing needed web pages using&nbsp;.NET,&nbsp;C .NET,&nbsp;JSON,&nbsp;HTML&nbsp;and&nbsp;jQuery.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Ability to develop container-based applications.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Development of application with n-tier architecture using Class libraries,&nbsp;Data entities, Services, Data access layer, business logic layer and stored procedures.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Perform Integration tests, Unit tests, and Stress and Regression tests&nbsp;with improved debugging standards.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Used SQL Tools such as&nbsp;Query Analyzer&nbsp;and&nbsp;SQL Profiler&nbsp;for query optimization.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Involved in all backup and database Restoring functions.</span></p><p>&nbsp;</p><p><strong><u>Job Requirements</u></strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>2 years experience as a software engineer working with large development projects. </span><u>(Ideally 3-5 years for Senior role)</u></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Bachelor’s degree in Computer Science, Communications Engineering or equivalent.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>ITIL preferred&nbsp;</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Working knowledge of programming methodologies, structures, and concepts</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Net framework, UML, XML, SharePoint.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>1-3 years’ experience with X++, performance tracing and diagnosis</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Expertise in developing N-tier web applications using&nbsp;.NET, C#, AJAX, XML, ASMX Web Services, SharePoint Server, JavaScript, Java, CSS, and HTML and allied&nbsp;Object-Oriented Programming concepts&nbsp;</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>&nbsp;Worked extensively with&nbsp;MS SQL Server databases and knowledge in&nbsp;Oracle </span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Extensively used&nbsp;SSIS, SSRS, Crystal Reports, SOAP, XML, XSD, and XSLT&nbsp;for disconnected databases and displayed proficiency in employing Data grids, Data Readers and Datasets for data manipulation</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Ability to understand Client's business needs, gathering requirements and translating these into functional and technical documentation </span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Familiarity with web technologies (Java, JavaScript, PHP, HTML, JSON, REST/WSDL/SOAP).</span></p><p><strong><u>Experience</u></strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>knowledge of Agile methodologies including agile artifacts &amp; ceremonies</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Industry-specific knowledge is a plus preferably (financial Industries)</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Willingness to learn in a fast-paced business environment</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Ability to work independently, resolve conflicts, and prioritize workflow in order to meet deadlines.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Ability to establish priorities, work collaboratively, and meet objectives.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Must have a positive attitude and strong customer service skills.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Creative, self-motivated with good analytical and problem-solving skills.</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Fast understanding of issues and problem-solving attitude</span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Strong Interpersonal skills </span></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span>Proven ability to work in teams</span></p><p><br></p>",
    "level": "senior",
    "application": "https://eg.linkedin.com/jobs/view/ms-dynamics-developer-at-the-tech-talents-3765077545",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "c#",
    "revised": true
  },
  {
    "title": "T24 Developer",
    "company": "Confidentiel",
    "location": "🇪🇬 Egypt",
    "description": "<p>The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code.&nbsp;</p><p>&nbsp;</p><p><strong>Responsibilities</strong></p><ul><li>Develop quality software and web applications</li><li>Analyze and maintain existing software applications</li><li>Design highly scalable, testable code</li><li>Discover and fix programming bugs</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>Minimum 5 years in Temenos T24 experience,</li><li>Bachelor's degree or equivalent experience in Computer Science or related field</li></ul>",
    "level": "junior",
    "application": "https://eg.linkedin.com/jobs/view/t24-developer-at-confidentiel-3766513231",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "-",
    "revised": true
  },
  {
    "title": "Backend Engineer with Ruby on Rails",
    "company": "Hyqoo",
    "location": "🇦🇪 United Arab Emirates",
    "description": "<p><strong>Job Title</strong>: <strong>Backend Engineer with Ruby on Rails</strong></p><p><strong>Location</strong>: <strong>Remote</strong></p><p><strong>Contract</strong>: <strong>12 months (possible extension)</strong></p><p><strong>Working Hours:</strong> <strong>Overlap with Arabian Time Zone</strong></p><p><br></p><p><strong>Day to Day Responsibilities:</strong></p><p>· A strong grasp of computer science fundamentals when it comes to dealing with distributed systems and networks.</p><p>· A knack for problem-solving and thinking from first principles. You don't shy away from any problem, no matter the scale or impact</p><p>· A bias towards shipping early and iterating. We believe in making small incremental changes to existing systems instead of large multi-quarter undertakings</p><p>· Proven experience as a Backend Engineer, with a strong track record of delivering high-quality software.</p><p>· Excellent mentoring and coaching abilities, with a passion for helping others succeed.</p><p>· Strong communication and interpersonal skills, enabling effective collaboration with cross-functional teams.</p><p>· Ability to navigate ambiguity, set clear expectations, and thrive in a fast-paced, dynamic environment.</p><p>· In-depth knowledge of Ruby on Rails framework, along with proficiency in related technologies like PostgreSQL, RESTful APIs, and MVC architecture.</p><p><br></p><p><br></p><p><strong>About Hyqoo:</strong></p><p>Hyqoo is an on-demand talent cloud platform connecting companies with remote and vetted talent across the globe. Set to upend the on-demand talent industry, Hyqoo is the world's leading source of vetted talent in data, software engineering, and product. Our clients engage with us to get high-performing talent for remote positions. Featuring the fastest growing global talent network, Hyqoo empowers leading organizations and startups with their global hiring needs at any scale. At the heart of its operation, Hyqoo’s propriety AI engine revolutionizes the talent vetting and matching process, providing engaged and qualified talent faster than any service on the market.</p><p>At Hyqoo, we understand how challenging, time-consuming, and costly it is to hire the best talent in technology. That is why we have created a Global Talent-as-a-Service Platform, which provides companies all over the world access to highly skilled, on-demand and fully vetted talent in Software Development, Design, Product and Project Management.</p><p>The main benefits of Hyqoo are our ‘Why’, large global footprint of over 14 million experts, guaranteed quality, technology at the forefront, and hyper-personalized and proactive approach.</p><p>To learn more please visit us at https://hyqoo.com/</p>",
    "level": "-",
    "application": "https://ae.linkedin.com/jobs/view/backend-engineer-with-ruby-on-rails-at-hyqoo-3761418623",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "ruby",
    "revised": true
  },
  {
    "title": "Senior Backend Engineer - Golang",
    "company": "HungerStation | هنقرستيشن",
    "location": "🇦🇪 United Arab Emirates",
    "description": "HungerStation.com is the leading online food ordering platform connecting thousands of restaurants with their customers across the Kingdom of Saudi Arabia &amp; Bahrain. Through its state-of-the-art tech and advanced logistics HungerStation has partnered with more than 43k + restaurants: enabling our customers with a greater choice and supporting the food delivery ecosystem. As well as fast food delivery, you can also order Groceries, Pharmacies, Flowers, Electronics and more creating a seamless experience of convenience for our customers.<br><br>We’re all about bringing on the smartest minds as we continue to grow in a fast-moving and agile environment; and hire those who can thrive in an e-commerce culture.<br><br>We are looking for a highly talented <strong>Senior Golang Engineer </strong>to join our team in Dubai. If you are looking for a place where you can gain hands-on experience and create a direct impact, then this may be the place for you! The ideal candidate will have a track record as a significant individual contributor as well as a strong team player, supporting a team, and working closely with the management teams to drive strategic initiatives forward across the region.<br><br><strong>Responsibilities<br><br></strong><ul><li>Take part in architectural decision-making on a platform that is used by millions of people.</li><li>Actively participate in migrating our monolithic application into Microservices.</li><li>Playing an active role in designing, improving and most importantly securing the overall backend architecture to support massive growth in users and products without compromise.</li><li>Deal with Docker containers, Kubernetes manifests, all this on Google Cloud Platform.</li><li>Coaching and mentoring other team members as a senior member of the team and member of our Backend Chapter</li><li>We embrace Design Driven Development, SOLID Principles, Event-driven Architecture, Algorithms and automated tests (unit, integration and functional).</li><li>Understanding development lifecycle and collaborating with cross-functional and agile teams. </li><li>Participate in the continuous and common effort of test coverage, refactoring and documentation.</li><li>Showing off your code review, debugging and investigation skills on a regular basis.<br><br></li></ul><strong>Requirements<br><br></strong><ul><li>More than 3 years of experience in GoLang and a minimum of 5 years of experience overall.</li><li>Strong experience with common monitoring/alerting/logging tools such as Prometheus, New Relic, Datadog, ELK stack, and distributed tracing.</li><li>You’ve built complex, high-quality applications, and have a strong knowledge of Domain Driven Design and microservice architecture.</li><li>You’re proficient in selecting from best practice Design Patterns and Design Principles when building your Software Architectures and Algorithms</li><li>Good knowledge of databases (PostgreSQL and NOSQL). (You should be aware of normal forms, ACID, isolation levels, index anatomy).</li><li>Flexible and open-minded personality and comfortable working in a multicultural environment and in English. </li><li>Familiar with the following; Docker &amp; Kubernetes, GCP, AWS, terraform and caching.</li><li>Experienced using TDD approach during development<br><br></li></ul><strong>What HungerStation Offers<br><br></strong><ul><li>We offer visa &amp; relocation support globally to our permanent employees.</li><li>Exchange ideas and meet 2000+ colleagues from different teams within Delivery Hero in our active guilds and through our global tech &amp; product community.</li><li>Develop your skills with your personal educational budget for conferences and external training. </li><li>Access our Linkedin learning platform and participate in our various in-house training. And much more…</li></ul>",
    "level": "senior",
    "application": "https://ae.linkedin.com/jobs/view/senior-backend-engineer-golang-at-hungerstation-%D9%87%D9%86%D9%82%D8%B1%D8%B3%D8%AA%D9%8A%D8%B4%D9%86-3452043624",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "go",
    "revised": true
  },
  {
    "title": "DotNet Developers & Senior Software Specialists",
    "company": "Rahma International",
    "location": "🇰🇼 Kuwait",
    "description": "<p><strong>About RAHMA International</strong></p><p>Rahma International is a Kuwait-based charitable organization established in 1982. It has expanded to over 40 countries worldwide and is the owner of the leading charity website in the Arab world, KhairOnline.net, which offers electronic donation services. Rahma International is a local philanthropic organization that contributes to alleviating the suffering of Muslims and minorities, promoting social development, and supporting human development in the regions it operates in.</p><p><br></p><p>Rahma International's vision is to become the leading private charity organization in the Arab world in terms of the comprehensiveness, type, and geography of its projects and its revenue capacity, in accordance with the highest institutional performance standards.</p><p><br></p><p><strong>Job Overview:</strong></p><p>We are looking for an innovative and experienced Senior .NET Developers &amp; Senior Software Specialists to join our team. Your role will be pivotal in developing and implementing web and windows business applications, system applications, as well as cross-platform mobile applications. If you enjoy translating complex business problems into efficient technical solutions and have a knack for turning functional requirements and wireframes into high-quality code, then we would like to meet you.</p><p> </p><p><strong>Key Responsibilities:</strong></p><p>- Develop, test, debug, and maintain web, windows, and cross-platform mobile applications.</p><p>- Effectively translate functional requirements, designs, and sketches into technical specifications and high-quality code.</p><p>- Generate highly responsive web-based user interfaces.</p><p>- Execute efficient bug fixing, code refactoring, and performance improvement of applications.</p><p>- Contribute actively to all phases of the development lifecycle.</p><p>- Manage legacy systems, addressing and solving existing issues while integrating with new systems.</p><p>- Create and modify SQL Server database objects using Transact-SQL.</p><p>- Monitor help desk queue, providing robust support and maintenance for installed applications.</p><p>- Adhere to the defined software development life cycle process.</p><p>- Preferred: Integration experience with ERP Systems (especially MS Dynamics).</p><p> </p><p><strong> Job Requirements:</strong></p><p>- Bachelor's degree in computer science or equivalent experience.</p><p>- Minimum of 4 years' experience developing with .NET Core and .NET Framework.</p><p>- Proficiency in C#, ASP.NET, VB.NET Technology.</p><p>- Solid understanding of object-oriented programming concepts and design patterns; SOLID principles knowledge a plus.</p><p>- Comprehensive experience with MVC, ASP.NET, HTML5, CSS3, JavaScript, Bootstrap, and jQuery libraries.</p><p>- Experience in SignalR, implementing Web API and web services.</p><p>- Proficient in programming to SQL databases, T-SQL (experience in MS SQL server is required).</p><p>- Understanding of MS SQL Reporting Services (SSRS), SSIS a plus.</p><p>- Familiarity with Entity Framework, ADO.NET, and Git source control.</p><p>- Mobile development experience (native &amp; cross-platform) is an advantage.</p><p>- Experience in ERP system integration (MS Dynamics) is preferred.</p><p>- SDLC and Agile Programming methodology knowledge.</p><p>- Microsoft certification is a plus.</p><p><strong>- For Senior Software Specialists (10 years of Experience &amp; more)</strong></p><p>- Salary depends on the organization’s internal regulations for salaries, commensurate with experience.</p><p><strong>- Fluent in reading and writing Arabic is a MUST</strong></p><p><strong>- Transferable Iqama</strong></p><p>This is an excellent opportunity to work with a dedicated team of professionals. If you have the necessary skills and experience, we invite you to apply for this rewarding role. Let's code the future together!</p><p><br></p>",
    "level": "senior",
    "application": "https://kw.linkedin.com/jobs/view/dotnet-developers-senior-software-specialists-at-rahma-international-3761452346",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "c#",
    "revised": true
  },
  {
    "title": "Software Developer (C, C++/Qt)",
    "company": "S4-Salam Security Systems & Services",
    "location": "🇶🇦 Qatar",
    "description": "Job description<p>We are seeking a skilled and motivated Application Developer to join our team and take responsibility for maintaining our cutting-edge application. The successful candidate will play a crucial role in ensuring the smooth functioning of our software with a desktop user interface written in C++ and the Qt library, backed by a Java-based backend, and equipped with agents written in C language using Modbus. The application also requires seamless integration with various subsystems utilizing SOAP/REST Web Services</p><p> </p><p><strong>Responsibilities</strong></p><ul><li>Maintenance and Support: Take ownership of the existing application, ensuring its stability, performance, and reliability. Proactively identify and resolve issues, bugs, and vulnerabilities in the software components.</li><li>Software Upgrades and Enhancements: Collaborate with the development team to implement upgrades and new features as per business requirements. Stay up-to-date with industry best practices and technological advancements, proposing improvements to the existing architecture.</li><li>Troubleshooting and Debugging: Analyze and troubleshoot complex software issues at both the frontend (C++/Qt) and backend (Java) levels. Effectively communicate the findings and recommend appropriate solutions.</li><li>Integration and Connectivity: Facilitate seamless integration with various subsystems using SOAP and REST APIs. Work closely with cross-functional teams to understand integration requirements and design robust solutions.</li><li>Modbus Agents Maintenance: Maintain and optimize C-based agents utilizing Modbus communication. Monitor their performance and ensure data integrity and synchronization with the backend.</li><li>Code Review and Documentation: Participate in code reviews to ensure code quality, adherence to coding standards, and maintainability. Document the existing codebase and new developments for easy reference and knowledge sharing.</li><li>Performance Optimization: Identify areas for performance improvement and conduct code profiling to optimize application performance and resource utilization.</li><li>Testing and Validation: Develop and execute test cases to validate the functionality, reliability, and security of the application. Implement automated testing strategies to streamline the testing process.</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>A bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent industry experience).</li><li>Proficiency in C++ and the Qt library for developing desktop applications.</li><li>Strong working knowledge of Java for backend development and experience with Java-based frameworks like Spring.</li><li>Experience in C programming and familiarity with Modbus communication protocols.</li><li>Demonstrated experience in integrating applications with external systems using SOAP and REST APIs.</li><li>Understanding of software development best practices, including version control (e.g., Git), code documentation, and code review processes.</li><li>Problem-solving skills with a keen eye for detail and the ability to analyze and debug complex issues.</li><li>Familiarity with software testing methodologies and test-driven development (TDD) practices.</li><li>Excellent teamwork and communication skills to collaborate effectively with a diverse team of developers and stakeholders.</li><li>Ability to adapt to changing requirements and work in a dynamic and fast-paced environment.</li></ul><li><br></li>",
    "level": "junior",
    "application": "https://qa.linkedin.com/jobs/view/software-developer-c-c%2B%2B-qt-at-s4-salam-security-systems-services-3766552661",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "java",
    "revised": true
  },
  {
    "title": "Senior Data Engineer",
    "company": "Aimhire",
    "location": "🇶🇦 Qatar",
    "description": "<p>The ideal candidate will have at least 15 years of experience in data architecture, data engineering, or relevant roles. A track record of successful design and implementation of enterprise-level data architecture, coupled with hands-on experience in operationalizing data strategies, is crucial. This role requires strong technical acumen, adaptability to diverse tools and technologies, and a deep understanding of both on-premise and cloud-based data ecosystems. If you are a passionate data architect who thrives on shaping data landscapes, we would love to hear from you. </p><p><br></p><p><strong>Responsibilities</strong></p><ul><li>Determine the required technology system architecture and functional design to support and align with the company's business objectives. </li><li>Set the context by defining common elements, creating patterns, and establishing standards to guide project-level details. </li><li>Aid management and stakeholders in assessing the company's mission to ensure effective utilization of its IT assets. </li><li>Document the process using multiple architectural models. • Create graphical representations and abstracts of system architecture models. </li><li>Evaluate existing IT systems for vulnerabilities or weaknesses that might impact performance, security, or efficiency. </li><li>Establish cross-functional teams, including Network, Operations, Development, Data Warehouse, and Quality, to facilitate the development of optimal architectures aligned with the architectural plan</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>Bachelor's degree in a relevant field (e.g., Computer Science, Information Technology, or a related discipline).</li><li>15+ years of experience in enterprise architecture, systems design, or a related role. </li><li>Proficiency in using architectural modelling tools and techniques.  </li><li>Strong analytical and problem-solving skills to evaluate existing IT systems.</li></ul>",
    "level": "senior",
    "application": "https://qa.linkedin.com/jobs/view/senior-data-engineer-at-aimhire-3761458508",
    "email": "x@gmail.com",
    "website": "",
    "workplace_type": "-",
    "tech": "-",
    "revised": true
  }
]